/* REXX **************************************************************/
/* Scan COBOL members for HR variables with exactly 2 decimal places */
/**********************************************************************/

ADDRESS TSO
ADDRESS ISPEXEC

PDS = "'YOUR.COBOL.PDS'"

"LMINIT DATAID(DATAID) DATASET("PDS") ENQ(SHRW)"
IF RC <> 0 THEN DO
   SAY "LMINIT FAILED RC="RC
   EXIT 8
END

"LMOPEN DATAID("DATAID") OPTION(INPUT)"
IF RC <> 0 THEN DO
   SAY "LMOPEN FAILED RC="RC
   EXIT 8
END

SAY
SAY "MEMBER   VARIABLE                      DEFINITION"
SAY "-------- ----------------------------- --------------------------------"

DO FOREVER

   MEMBER=""

   "LMMLIST DATAID("DATAID") OPTION(LIST) MEMBER(MEMBER)"

   IF RC<>0 THEN LEAVE

   DDNAME="SYSUT1"

   "ALLOC FI("DDNAME") DA("PDS"("MEMBER")) SHR REUSE"

   "EXECIO * DISKR "DDNAME" (STEM REC. FINIS"

   "FREE FI("DDNAME")"

   INWS=0
   DEF=""

   DO I=1 TO REC.0

      LINE=TRANSLATE(REC.I)

      IF POS("WORKING-STORAGE SECTION",LINE)>0 THEN DO
         INWS=1
         ITERATE
      END

      IF INWS=0 THEN ITERATE

      IF POS("PROCEDURE DIVISION",LINE)>0 |,
         POS("LINKAGE SECTION",LINE)>0 |,
         POS("LOCAL-STORAGE SECTION",LINE)>0 THEN DO

         IF DEF<>"" THEN
            CALL CHECKDEF MEMBER,DEF

         LEAVE
      END

      S=STRIP(LINE)

      IF S="" THEN ITERATE
      IF SUBSTR(S,1,1)="*" THEN ITERATE

      PARSE VAR S LVL REST

      IF DATATYPE(LVL,'W') THEN DO

         IF DEF<>"" THEN
            CALL CHECKDEF MEMBER,DEF

         DEF=S

      END
      ELSE DO

         DEF=DEF" "S

      END

   END

   IF DEF<>"" THEN
      CALL CHECKDEF MEMBER,DEF

END

"LMCLOSE DATAID("DATAID")"
"LMFREE DATAID("DATAID")"

EXIT 0


CHECKDEF:

PARSE ARG MEMBER,DEF

U=TRANSLATE(DEF)

IF POS("PIC",U)=0 THEN
   RETURN

PARSE VAR U LEVEL VAR REST

IF VAR="" THEN
   RETURN

IF POS("HR",VAR)=0 THEN
   RETURN

/* Normalize PIC formats */

U=CHANGESTR("V9(02)","V99",U)
U=CHANGESTR("V9(2)","V99",U)
U=CHANGESTR(".9(02)",".99",U)
U=CHANGESTR(".9(2)",".99",U)

MATCH=0

P=POS("V99",U)
IF P>0 THEN
   IF SUBSTR(U,P+3,1)<>"9" THEN
      MATCH=1

P=POS(".99",U)
IF P>0 THEN
   IF SUBSTR(U,P+3,1)<>"9" THEN
      MATCH=1

IF MATCH THEN
   SAY LEFT(MEMBER,8) LEFT(VAR,29) DEF

RETURN
