./       ADD   NAME=A
//JONNALMQ JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYA
//JOBLIB    DD DSN=ACPT.BATCH.LOAD,DISP=SHR
//          DD DSN=PROD.BATCH.LOAD,DISP=SHR
//JCLPROC   JCLLIB ORDER=DEVT.LAWSON.PROCLIB
//************************************************* STEP020 **********
//*                                                                  *
//*   SEND MQ MESSAGES TO VISTA WITH DEALER ACCEPTANCE RATINGS.      *
//*                                                                  *
//************************************************* STEP020 **********
//STEP020 EXEC PGM=IKJEFT1A,COND=(0,NE),
//             REGION=1024K
//STEPLIB  DD DSN=ACPT.BATCH.LOAD,DISP=SHR
//*** INPUT FILES
//WASR050T DD  DSN=WAWA.WASR050B.DATA,DISP=SHR
//WASR050L DD  DSN=WAWA.WASR050B.LEXUS.DATA,DISP=SHR
//WACC998O DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSDBOUT DD  SYSOUT=*
//SYSABOUT DD  SYSOUT=*
//SYSTSPRT DD  SYSOUT=*
//SYSTSIN   DD *
  DSN SYSTEM(DSNA)
  RUN PROGRAM(WASR180B) PLAN(WASR180B) LIB('ACPT.BATCH.LOAD') -
  PARMS('MQAA')
/*
//*
./       ADD   NAME=ACDCCOPY
//JONNALRI  JOB (TEST,DEV),'IDCAMS STUFF',CLASS=A,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   DEFINE F01   VSAM FILE                                     *
//****************************************************************
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
    DELETE (ACDC$DV.F01.ERRMSG.FILE)     -
           PURGE                         -
           CLUSTER
    DEFINE CLUSTER (                                  -
              NAME (ACDC$DV.F01.ERRMSG.FILE)         -
              TRACKS (4 2)                           -
              FREESPACE (10 10)                      -
              INDEXED                                -
              KEYS (4 0)                             -
              RECORDSIZE (83 83)                     -
              SHR (2)                                -
              REUSE                                  -
              SPEED                                  -
                                                     -
              ) -
          DATA (                                     -
              NAME (ACDC$DV.F01.ERRMSG.FILE.DATA)    -
              CISZ (4096)                            -
              ) -
          INDEX (                                    -
              NAME (ACDC$DV.F01.ERRMSG.FILE.INDEX)   -
              CISZ (512)                             -
              )
/*
//****************************************************************
//*   REPRO  F01   VSAM FILE FROM PRODUCTION                     *
//****************************************************************
//STEP02 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=ACDC.F01.ERRMSG.FILE,
//            DISP=SHR
//DD2      DD DSN=ACDC$DV.F01.ERRMSG.FILE,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//****************************************************************
//*   DEFINE F02    VSAM FILE                                    *
//****************************************************************
//STEP03    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
    DELETE (ACDC$DV.F02.INVOICE.FILE)         -
           PURGE                              -
           CLUSTER
    DEFINE CLUSTER (                                   -
              NAME (ACDC$DV.F02.INVOICE.FILE)         -
              CYLINDERS (728 14)                      -
              FREESPACE (10 10)                       -
              INDEXED                                 -
              KEYS (21 0)                             -
              RECORDSIZE (1351 1351)                  -
              SHR (2)                                 -
              SPEED                                   -
                                                      -
              )
/*
//****************************************************************
//*   REPRO F02    VSAM FILE FROM PRODUCTION                     *
//****************************************************************
//STEP04 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=ACDC.F02.INVOICE.FILE,
//            DISP=SHR
//DD2      DD DSN=ACDC$DV.F02.INVOICE.FILE,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//
//****************************************************************
//*   DEFINE F02 AIX VSAM FILE                                   *
//****************************************************************
//STEP03    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
   DELETE  (ACDC$DV.F02B.INVOICE.FILE.AIX)    -
           PURGE                   -
           AIX
   DEFINE ALTERNATEINDEX (                            -
              NAME (ACDC$DV.F02B.INVOICE.FILE.AIX)    -
              RELATE (ACDC$DV.F02.INVOICE.FILE)       -
              CYLINDERS (11 2)                         -
              FREESPACE (10 10)                       -
              NONUNIQUEKEY                            -
              KEYS (7 21)                             -
              RECORDSIZE (2112 32562)                 -
              SHR (2)                                 -
              SPEED                                   -
                                                      -
              )
    DEFINE PATH (                                     -
               NAME (ACDC$DV.F02B.INVOICE.FILE.PATH)  -
               PATHENTRY (ACDC$DV.F02B.INVOICE.FILE.AIX) -
               )
    BLDINDEX                                          -
               INDATASET (ACDC$DV.F02.INVOICE.FILE)   -
               OUTDATASET (ACDC$DV.F02B.INVOICE.FILE.AIX)
/*
//****************************************************************
//
//****************************************************************
//*   DEFINE MODEL VSAM FILE                                     *
//****************************************************************
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
    DELETE (ACDC$DV.F03.PAYEE.MASTER.FILE)    -
           PURGE                              -
           CLUSTER
   DEFINE CLUSTER (                                   -
              NAME (ACDC$DV.F03.PAYEE.MASTER.FILE)    -
              TRACKS (15 2)                           -
              FREESPACE (10 10)                       -
              INDEXED                                 -
              KEYS (5 0)                              -
              RECORDSIZE (200 200)                    -
              SHR (2)                                 -
              REUSE                                   -
              SPEED                                   -
                                                      -
              ) -
          DATA (                                      -
              NAME (ACDC$DV.F03.PAYEE.MASTER.FILE.DATA) -
              CISZ (4096)                             -
              )                                       -
          INDEX (                                     -
              NAME (ACDC$DV.F03.PAYEE.MASTER.FILE.INDEX) -
              CISZ (512)                              -
              )
/*
//****************************************************************
//*   REPRO  MODEL VSAM FILE FROM PRODUCTION                     *
//****************************************************************
//STEP02 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=ACDC.F03.PAYEE.MASTER.FILE,
//            DISP=SHR
//DD2      DD DSN=ACDC$DV.F03.PAYEE.MASTER.FILE,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
./       ADD   NAME=ARGL
//JONNALRS JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//*-------------------------------------------------------------------*
//*- ACLA400B AR FILE SEARCH
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0175V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0176V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0177V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0178V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0179V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0180V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0181V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0182V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0183V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0184V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0185V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0186V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0187V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0188V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0189V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0190V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0191V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0192V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0193V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0194V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0195V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0196V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0197V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0198V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0199V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0200V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0201V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0202V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0203V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0204V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.ARDETAIL.DATA.G0205V00,DISP=SHR
/*
//SORTOUT   DD DSN=JONNALR.#6190XX.AR,DISP=SHR
//*INCLUDE COND=(57,09,CH,EQ,C'161901054')
//*INCLUDE COND=(74,05,CH,EQ,C'48105')
//SYSIN     DD *
 SORT    FIELDS=COPY
 INCLUDE COND=(57,05,CH,EQ,C'16190',AND,64,02,CH,EQ,C'54')
 OUTREC FIELDS=(74,5,5X,
                 57,09,6X,
                 145,7,5X)
//*
//*-------------------------------------------------------------------*
//*- ACLA400B GL FILE SEARCH
//*-------------------------------------------------------------------*
//STEP020 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0175V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0176V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0177V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0178V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0179V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0180V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0181V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0182V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0183V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0184V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0185V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0186V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0187V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0188V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0189V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0190V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0191V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0192V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0193V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0194V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0195V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0196V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0197V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0198V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0199V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0200V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0201V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0202V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0203V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0204V00,DISP=SHR
//          DD DSN=ACLA.ACLA400B.GLDETAIL.DATA.G0205V00,DISP=SHR
/*
//SORTOUT   DD DSN=JONNALR.#6190XX.GL400,DISP=SHR
//*INCLUDE COND=(72,05,CH,EQ,C'48105')
//SYSIN     DD *
 SORT    FIELDS=COPY
 INCLUDE COND=(39,05,CH,EQ,C'16190',AND,46,02,CH,EQ,C'54')
 OUTREC FIELDS=(72,5,5X,
                 39,09,6X,
                 228,7,5X)
//*
//*-------------------------------------------------------------------*
//*- ACLA410B GL FILE SEARCH
//*-------------------------------------------------------------------*
//STEP030 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0175V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0176V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0177V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0178V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0179V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0180V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0181V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0182V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0183V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0184V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0185V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0186V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0187V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0188V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0189V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0190V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0191V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0192V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0193V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0194V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0195V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0196V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0197V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0198V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0199V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0200V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0201V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0202V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0203V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0204V00,DISP=SHR
//          DD DSN=ACLA.ACLA410B.GLDETAIL.DATA.G0205V00,DISP=SHR
/*
//SORTOUT   DD DSN=JONNALR.#6190XX.GL410,DISP=SHR
//*INCLUDE COND=(72,05,CH,EQ,C'48105')
//SYSIN     DD *
 SORT    FIELDS=COPY
 INCLUDE COND=(39,05,CH,EQ,C'16190',AND,46,02,CH,EQ,C'54')
 OUTREC FIELDS=(72,5,5X,
                 39,09,6X,
                 228,7,5X)
//
./       ADD   NAME=BINDTEST
//JONNALRB JOB (2005,TOPS),'BIND ',
//          MSGLEVEL=(1,1),
//          NOTIFY=JONNALR,
//          MSGCLASS=X,
//          USER=DEVDBA,
//          CLASS=F
//JOBLIB  DD DSN=SYS2.DB2.DSNT.SDSNLOAD,DISP=SHR
//********************************************************
//*        BIND A DB2 PLAN FROM THE DBRMLIB
//********************************************************
//BIND     EXEC PGM=IKJEFT01
//DBRMLIB DD  DSN=TEST.DB2.DBRMLIB,DISP=SHR
//        DD  DSN=PROD.DB2.DBRMLIB,DISP=SHR
//        DD  DSN=ACPT.DB2.DBRMLIB,DISP=SHR
//        DD  DSN=PROD.DB2.DBRMLIB,DISP=SHR
//        DD  DSN=SYS2.EDI.SEDIDBR1,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD DSN=PROD.DB2.COMMANDS(#RUNTEST),DISP=SHR
//        DD DSN=PROD.DB2.BIND(ADEM005P),DISP=SHR
./       ADD   NAME=BMTRTEMP
24015
99999
./       ADD   NAME=CARTLABL
//JONNALRT  JOB (TEST,DEV),'TAPE LABEL INFO',CLASS=A,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   THIS JOB USES SAS TO DETERMINE WHAT INFORMATION IS         *
//*   KEPT ON THE LABEL OF A CARTRIDGE TAPE.                     *
//****************************************************************
//TESTLABL  EXEC SAS
//SASLOG    DD DUMMY
//SASLIST   DD SYSOUT=X
//TAPE      DD UNIT=CART,
//             DISP=OLD,
//             VOL=SER=C08299,
//             LABEL=(,BLP,EXPDT=98000)
//SYSIN     DD *

PROC TAPELABEL DDNAME=(TAPE);
   TITLE 'LABEL INFO'

/*
//
//****************************************************************
//*   THIS JOB USES SAS TO DETERMINE WHAT INFORMATION IS         *
//*   KEPT ON THE LABEL OF A CARTRIDGE TAPE.                     *
//****************************************************************
//PRODLABL  EXEC SAS
//SASLOG    DD DUMMY
//SASLIST   DD SYSOUT=X
//TAPE      DD UNIT=CART,
//             DSN=VHDI.TYADIN,
//             DISP=OLD,
//             VOL=SER=C06541,
//             LABEL=(,BLP)
//SYSIN     DD *

PROC TAPELABEL DDNAME=(TAPE);
   TITLE 'LABEL INFO'

/*
//*
./       ADD   NAME=COB2SAS
//STEP1  EXEC  PROC=SAS,OPTIONS='MACRO,DQUOTE'
//COB2SAS DD  DISP=SHR,DSN=SAS.COB2SAS
//INCOBOL DD  DISP=SHR,DSN=SYS1.COPYLIB(XXXXXX)
//OUTSAS  DD  DSN=***.***(XXXXXX),DISP=SHR
//SYSIN   DD  *
  OPTIONS NONOTES NOSOURCE NOSOURCE2;
  %INCLUDE COB2SAS(R2MVS);
  RUN;
  PROC PRINT DATA=DICTNRY;
     BY FILENAME NOTSORTED;
     FORMAT RDF_NAME $8.;
     ID LEVEL;
     VAR NST_DPTH NEWNAME USAGE PICTURE INFMT ATBYTE
         BYTES OCR_VAL RDF_NAME;
  RUN;
/*
//
./       ADD   NAME=COLCOPY
//JONNALRI  JOB (TEST,DEV),'IDCAMS STUFF',CLASS=A,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   DEFINE MODEL VSAM FILE                                     *
//****************************************************************
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING MODEL FILE                               */
 /*                                                              */
   DELETE  (VHDI.COLOUR.PRIMARY)  -
           PURGE                  -
           CLUSTER
 /*                                                              */
 /* DEFINE THE MODEL FILE                                        */
   DEFINE  CLUSTER (NAME (VHDI.COLOUR.PRIMARY)      -
                    TRACKS (2 1)                    -
                    FREESPACE (0 0)                 -
                    INDEXED                         -
                    KEYS (8 0)                      -
                    RECORDSIZE (100 100)            -
                    SHAREOPTIONS (2)                -
                    SPEED                           -
                                      )             -
           DATA (NAME (VHDI.COLOUR.PRIMARY.DATA))   -
           INDEX (NAME (VHDI.COLOUR.PRIMARY.INDEX))
/*
//****************************************************************
//*   REPRO  MODEL VSAM FILE FROM PRODUCTION                     *
//****************************************************************
//STEP02 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=VHDI.COLOUR.PRIMARY,
//            DISP=SHR
//DD2      DD DSN=VHDI$DV.COLOUR.PRIMARY,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
./       ADD   NAME=COMPARE
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
//*
//COMPAR1   EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//NEWDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.CURYR.MODEL.AFT
//OLDDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.CURYR.MODEL.BEF
//OUTDD  DD SYSOUT=*
//
//COMPAR2   EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//* INVOKE ISPF COMPARE TO CHECK THE RESULTS
//* DON'T COMPARE COLUMNS 15-34 WHICH CAN VARY
//NEWDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.NXTYR.MODEL.AFT
//OLDDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.NXTYR.MODEL.BEF
//OUTDD  DD SYSOUT=*
//*
//COMPAR3   EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//* INVOKE ISPF COMPARE TO CHECK THE RESULTS
//* DON'T COMPARE COLUMNS 15-34 WHICH CAN VARY
//NEWDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.CURYR.SUFX.AFT
//OLDDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.CURYR.SUFX.BEF
//OUTDD  DD SYSOUT=*
//*
//COMPAR4   EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//* INVOKE ISPF COMPARE TO CHECK THE RESULTS
//* DON'T COMPARE COLUMNS 15-34 WHICH CAN VARY
//NEWDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.NXTYR.SUFX.AFT
//OLDDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.NXTYR.SUFX.BEF
//OUTDD  DD SYSOUT=*
//*
//COMPAR5   EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//* INVOKE ISPF COMPARE TO CHECK THE RESULTS
//* DON'T COMPARE COLUMNS 15-34 WHICH CAN VARY
//NEWDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.CURYR.SEC.AFT
//OLDDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.CURYR.SEC.BEF
//OUTDD  DD SYSOUT=*
//*
//COMPAR6   EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//* INVOKE ISPF COMPARE TO CHECK THE RESULTS
//* DON'T COMPARE COLUMNS 15-34 WHICH CAN VARY
//NEWDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.NXTYR.SEC.AFT
//OLDDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.NXTYR.SEC.BEF
//OUTDD  DD SYSOUT=*
//*
//COMPAR7   EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//* INVOKE ISPF COMPARE TO CHECK THE RESULTS
//* DON'T COMPARE COLUMNS 15-34 WHICH CAN VARY
//NEWDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.CURYR.APX.AFT
//OLDDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.CURYR.APX.BEF
//OUTDD  DD SYSOUT=*
//*
//COMPAR8   EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//* INVOKE ISPF COMPARE TO CHECK THE RESULTS
//* DON'T COMPARE COLUMNS 15-34 WHICH CAN VARY
//NEWDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.NXTYR.APX.AFT
//OLDDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.NXTYR.APX.BEF
//OUTDD  DD SYSOUT=*
//*
//COMPAR9   EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//* INVOKE ISPF COMPARE TO CHECK THE RESULTS
//* DON'T COMPARE COLUMNS 15-34 WHICH CAN VARY
//NEWDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.CURYR.TRL.AFT
//OLDDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.CURYR.TRL.BEF
//OUTDD  DD SYSOUT=*
//*
//COMPAR10  EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//* INVOKE ISPF COMPARE TO CHECK THE RESULTS
//* DON'T COMPARE COLUMNS 15-34 WHICH CAN VARY
//NEWDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.NXTYR.TRL.AFT
//OLDDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.NXTYR.TRL.BEF
//OUTDD  DD SYSOUT=*
//*
//COMPAR11  EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//* INVOKE ISPF COMPARE TO CHECK THE RESULTS
//* DON'T COMPARE COLUMNS 15-34 WHICH CAN VARY
//NEWDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.PRVYR.AFY.AFT
//OLDDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.PRVYR.AFY.BEF
//OUTDD  DD SYSOUT=*
//*
//COMPAR12  EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//* INVOKE ISPF COMPARE TO CHECK THE RESULTS
//* DON'T COMPARE COLUMNS 15-34 WHICH CAN VARY
//NEWDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.NXTYR.AFY.AFT
//OLDDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.NXTYR.AFY.BEF
//OUTDD  DD SYSOUT=*
//*
//COMPAR13  EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//* INVOKE ISPF COMPARE TO CHECK THE RESULTS
//* DON'T COMPARE COLUMNS 15-34 WHICH CAN VARY
//NEWDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.CURYR.AFY.AFT
//OLDDD   DD  DISP=SHR,DSN=DCVH$DV.DCS.CURYR.AFY.BEF
//OUTDD  DD SYSOUT=*
//*
//
//SYSIN   DD *
 CMPCOLMN 1:618 634:637
 CMPCOLMO 1:618 634:637
//*
//COMPARE   EXEC PGM=ISRSUPC,
//            PARM='DELTAL,LINECMP'
//* INVOKE ISPF COMPARE TO CHECK THE RESULTS
//* DON'T COMPARE COLUMNS 15-34 WHICH CAN VARY
//NEWDD   DD  DISP=SHR,DSN=VHDI$DV.ADEM600B.OPTION.FILE.AFT
//OLDDD   DD  DISP=SHR,DSN=VHDI$DV.ADEM600B.OPTION.FILE.BEF
//OUTDD  DD SYSOUT=*
//SYSIN   DD *
 CMPCOLMN 1:86
 CMPCOLMO 1:86
//
./       ADD   NAME=COPYACGL
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//JOBLIB    DD DSN=TEST.BATCH.LOAD,DISP=SHR
//          DD DSN=PROD.BATCH.LOAD,DISP=SHR
//JCLPROC   JCLLIB ORDER=DEVT.LAWSON.PROCLIB
//STEP003 EXEC PGM=IDCAMS,REGION=1024K,COND=(0,NE)
//SYSPRINT DD  SYSOUT=*
//SEQ      DD  DSN=ACGL.GENACCT,DISP=SHR
//OUT      DD  DSN=ACGL$DV.GL.ACCOUNT.MASTER.B4.YREND05,
//             UNIT=TEST,
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=19000),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(200,100),RLSE)
//SYSIN    DD  DSN=PROD.BATCH.CNTL(REPRO),DISP=SHR
//
//********************************************************
//*   STEP005 TAKES A BACKUP OF THE YTD POSTING FILE.
//********************************************************
//STEP005 EXEC PGM=IDCAMS,REGION=1024K,COND=(0,NE)
//SYSPRINT DD  SYSOUT=*
//SEQ      DD  DSN=ACGL.GENYTD,DISP=SHR
//OUT      DD  DSN=ACGL$DV.YTD.POSTING.FILE.B4.YREND05,
//             UNIT=TEST,
//             DCB=(RECFM=FB,LRECL=28,BLKSIZE=19068),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(200,100),RLSE)
//SYSIN    DD  DSN=PROD.BATCH.CNTL(REPRO),DISP=SHR
//*
./       ADD   NAME=COPYESDS
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//****************************************************************
//*   THIS JOB USES THE IDCAMS UTILITY TO RESTORE THE MISC       *
//*   DEBIT/CREDIT F02 INVOICE FILE TO THE HISTORY FILE.         *
//****************************************************************
//DLETDEF EXEC PGM=IDCAMS,REGION=1024K
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 /*                                                              */
 /* DELETE THE EXISTING DR/CR NOTE INVOICE INFORMATION FILE      */
 /*                                                              */
    DELETE (WAWA$DV.WAR.PRINT.FILE.SORT.JUL06)         -
           PURGE                              -
           CLUSTER
 /*                                                              */
 /* DEFINE THE DR/CR NOTE INVOICE INFORMATION FILE               */
 /*        FORMAT: KSDS                                          */
 /*        KEY   : 21 BYTES LONG, SEE COPYBOOK ACDC002F          */
 /*                                                              */
   DEFINE CLUSTER (                                   -
              NAME (WAWA$DV.WAR.PRINT.FILE.SORT.JUL06)         -
              CYLINDERS (30 20)                      -
              FREESPACE (10 10)                       -
              NONINDEXED                                 -
              RECORDSIZE (172 172)                  -
              SHR (2)                                 -
                                                      -
              )
/*
//****************************************************************
//REPRO  EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=WAWA.WAR.PRINT.FILE.SORT,
//            DISP=SHR
//DD2      DD DSN=WAWA$DV.WAR.PRINT.FILE.SORT.JUL06,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
./       ADD   NAME=COPYPCDM
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//****************************************************************
//*   THIS JOB USES THE IEBGENER UTILITY TO COPY SOMETHING       *
//*   TO SOMETHING ELSE.                                         *
//****************************************************************
//*   NOTE: THESE FILES ARE PRODUCED EVERY DAY SO ON MONDAYS,    *
//*   ====  YOU NEED TO COPY THREE (FRIDAY, SATURDAY, SUNDAY).   *
//****************************************************************
//COPY100A EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=PCDM.PCDM600B.ERRREPT,
//             DISP=SHR
//SYSUT2    DD DSN=PCDM$DV.PCDM600B.ERRREPT.AUG01,
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=TEST,
//             SPACE=(CYL,(20,10),RLSE),
//*            DCB=(RECFM=FB,LRECL=1111,BLKSIZE=0)
//             LIKE=PCDM.PCDM600B.ERRREPT
//SYSIN     DD DUMMY
//*
./       ADD   NAME=COPYPURC
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//****************************************************************
//*   THIS JOB USES THE IEBGENER UTILITY TO COPY SOMETHING       *
//*   TO SOMETHING ELSE.                                         *
//****************************************************************
//*   NOTE: THESE FILES ARE PRODUCED EVERY DAY SO ON MONDAYS,    *
//*   ====  YOU NEED TO COPY THREE (FRIDAY, SATURDAY, SUNDAY).   *
//****************************************************************
//COPY100A EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=WAWA.WAMM006.WAR037B.TEMP,
//             DISP=SHR
//SYSUT2    DD DSN=WAWA$DV.WAMM006.WAR037B.TEMP.JUL06,
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=TEST,
//             SPACE=(CYL,(20,10),RLSE),
//*            DCB=(RECFM=FB,LRECL=1111,BLKSIZE=0)
//             LIKE=WAWA.WAMM006.WAR037B.TEMP
//SYSIN     DD DUMMY
//*
./       ADD   NAME=COPYSORT
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//*--------------------------------------------------------------------
//SYSOUT    DD SYSOUT=*
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SORTIN    DD DSN=JONNALR.INPUT,
//             DISP=SHR
//SORTOUT   DD DSN=JONNALR.OUTPUT,
//             DISP=SHR
//SYSIN     DD DSN=JONNALR.TEST.PARM(OUTREC1),DISP=SHR
//
//SYSIN     DD DSN=JONNALR.TEST.PARM(COPYSORT),DISP=SHR
//
./       ADD   NAME=DBDEMO
//JONNALRF JOB (TEST,DEV),'DB2 UNLOAD/RELOAD',
//         CLASS=E,NOTIFY=JONNALR,MSGCLASS=X,,,,
//****************************************************************
//*   THIS JOB USES THE DB2 UTILITY WITH SQL TO EXTRACT SELECTED *
//*   TABLES FROM PRODUCTION AND LOAD THEM TO TEST.              *
//****************************************************************
//*   THIS JOB EXTRACTS ROWS FROM DACACCT.TE1_DEMO_VEHICLES,     *
//*   DACACCT.TE2_DEMO_FINANCIAL, DACACCT.TE3_DEMO_DLR_OPT,      *
//*   DACACCT.TE4_DEMO_FCT_OPT,   DACACCT.TE5_DEMO_RESERVED,     *
//*   DACACCT.TE6_DEMO_DRIVERS,   DACACCT.TE7_DEMO_ZONE_TOTS,    *
//*   AND DACACCT.TE8_DEMO_ACTIVITY.                             *
//****************************************************************
//*   NOTE: IF YOU LOAD USING THE SYSIN FILE CREATED BY THE      *
//*   ====  UNLOAD STEP, YOU MUST MANUALLY TYPE IN 'REPLACE'     *
//*         AFTER 'LOAD DATA' IN ORDER TO DELETE EXISTING DATA.  *
//****************************************************************
//*
//ERASE EXEC PGM=IEFBR14,DYNAMNBR=80,REGION=2048K
//DD01    DD DSN=VHDI$DV.TE1.UNLOAD.DATA,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD01B   DD DSN=VHDI$DV.TE1.UNLOAD.SYSIN,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD02    DD DSN=VHDI$DV.TE2.UNLOAD.DATA,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD02B   DD DSN=VHDI$DV.TE2.UNLOAD.SYSIN,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD03    DD DSN=VHDI$DV.TE3.UNLOAD.DATA,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD03B   DD DSN=VHDI$DV.TE3.UNLOAD.SYSIN,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD04    DD DSN=VHDI$DV.TE4.UNLOAD.DATA,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD04B   DD DSN=VHDI$DV.TE4.UNLOAD.SYSIN,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD05    DD DSN=VHDI$DV.TE5.UNLOAD.DATA,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD05B   DD DSN=VHDI$DV.TE5.UNLOAD.SYSIN,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD06    DD DSN=VHDI$DV.TE6.UNLOAD.DATA,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD06B   DD DSN=VHDI$DV.TE6.UNLOAD.SYSIN,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD07    DD DSN=VHDI$DV.TE7.UNLOAD.DATA,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD07B   DD DSN=VHDI$DV.TE7.UNLOAD.SYSIN,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD08    DD DSN=VHDI$DV.TE8.UNLOAD.DATA,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD08B   DD DSN=VHDI$DV.TE8.UNLOAD.SYSIN,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//*
//********************************************************************
//*            JOB NUMBER : DSNTIAUL WITH PARM('SQL')
//*            FUNCTIONS  : EXTRACT SPECIFIED RECORDS
//********************************************************************
//UNLOAD1  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DSN=PROD.DB2.COMMANDS(#RUNDSNP),DISP=SHR
//         DD DSN=PROD.DB2.COMMANDS(#INDSNP),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSREC00 DD DSN=VHDI$DV.TE1.UNLOAD.DATA,
//            DISP=(,CATLG,DELETE),UNIT=SYSALLDA,SPACE=(CYL,(20,10))
//SYSPUNCH DD DSN=VHDI$DV.TE1.UNLOAD.SYSIN,
//            DISP=(,CATLG,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(1,1))
//SYSIN    DD *
   SELECT    *  FROM    DACACCT.TE1_DEMO_VEHICLES ;
/*
//*
//********************************************************************
//*            LOAD THE TABLE
//********************************************************************
//LOAD4   EXEC DSNUPROC,SYSTEM=DSNT,UID='LOADTE1',UTPROC='',COND=(7,LT)
//*
//DSNUPROC.SYSREC00 DD DSN=VHDI$DV.TE4.UNLOAD.DATA,
//             DISP=SHR
//DSNUPROC.SORTWK01 DD DSN=&&SORTWK01,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SORTWK02 DD DSN=&&SORTWK02,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SORTWK03 DD DSN=&&SORTWK03,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SORTWK04 DD DSN=&&SORTWK04,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SYSMAP   DD DSN=&&SMAPT,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(300,80),RLSE),
//             UNIT=SYSDA
//DSNUPROC.SYSUT1   DD DSN=&&SYSUT1,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(400,100),RLSE),
//             UNIT=SYSDA
//DSNUPROC.SORTOUT  DD DSN=&&SORTOUT,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(400,100),RLSE),
//             UNIT=SYSDA
//DSNUPROC.SYSIN    DD *
  LOAD DATA REPLACE LOG NO INDDN SYSREC00 INTO TABLE
      DACACCT.TE4_DEMO_FCT_OPT
   (
   E4_WMI                                 POSITION(       1         )
   CHAR(                      3) ,
   E4_VDS                                 POSITION(       4         )
   CHAR(                      5) ,
   E4_CHECK_DIGIT                         POSITION(       9         )
   CHAR(                      1) ,
   E4_YEAR                                POSITION(      10         )
   CHAR(                      1) ,
   E4_PLANT                               POSITION(      11         )
   CHAR(                      1) ,
   E4_SERIAL                              POSITION(      12         )
   CHAR(                      6) ,
   E4_CONTROL_NUMBER                      POSITION(      18         )
   SMALLINT                      ,
   E4_FCT_OPT_CODE                        POSITION(      20         )
   CHAR(                      4) ,
   E4_FCT_OPT_LANDED                      POSITION(      24:      27)
   DECIMAL                       ,
   E4_FCT_OPT_DLRNET                      POSITION(      28:      31)
   DECIMAL                       ,
   E4_FCT_OPT_DESC                        POSITION(      32         )
   CHAR(                     30) ,
   E4_FCT_OPT_FLAG                        POSITION(      62         )
   CHAR(                      1) ,
   E4_LST_UPD_USERID                      POSITION(      63         )
   CHAR(                      8) ,
   E4_LST_UPD_PGM_ID                      POSITION(      71         )
   CHAR(                      8) ,
   E4_TIMESTAMP                           POSITION(      79         )
   TIMESTAMP EXTERNAL(       26)
   )
//*
//
//********************************************************************
//*            START THE TABLESPACES
//********************************************************************
//FORCEDB  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(7,LT)
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
  DSN SYSTEM(DSNT)
     -START DATABASE(DACACCT) SPACENAM(SADEME1) ACCESS(FORCE)
     -START DATABASE(DACACCT) SPACENAM(SADEME2) ACCESS(FORCE)
     -START DATABASE(DACACCT) SPACENAM(SADEME3) ACCESS(FORCE)
     -START DATABASE(DACACCT) SPACENAM(SADEME4) ACCESS(FORCE)
     -START DATABASE(DACACCT) SPACENAM(SADEME5) ACCESS(FORCE)
     -START DATABASE(DACACCT) SPACENAM(SADEME6) ACCESS(FORCE)
     -START DATABASE(DACACCT) SPACENAM(SADEME7) ACCESS(FORCE)
     -START DATABASE(DACACCT) SPACENAM(SADEME8) ACCESS(FORCE)
  END
/*
./       ADD   NAME=DCSF01
//JONNALRI  JOB (TEST,DEV),'IDCAMS STUFF',CLASS=F,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//*********************************************************************
//STEP010 EXEC PGM=MTPBATCH
//*********************************************************************
//*  CLOSE THE FILE IN CICS
//*********************************************************************
//STEPLIB  DD DSN=SYS3.BMTP.ACPT.LOAD,DISP=SHR
//SYSLST   DD SYSOUT=*
//BATCNTL  DD DSN=SYST.BMTP.ACPTCNTL.FILE,DISP=SHR
//BATSTAT  DD DSN=SYST.BMTP.ACPTSTAT.FILE,DISP=SHR
//SYSUDUMP DD SYSOUT=*
//SYSIPT   DD *
CICS CICSAAOR
CEMT S FILE(DCSF01)  CLO
//*
//****************************************************************
//*   DEFINE MODEL VSAM FILE                                     *
//****************************************************************
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /*                                                              */
 /* DELETE THE EXISTING DCF ONLINE LOG FILE                      */
 /*                                                              */
    DELETE (DCDT$AT.F01.LOG.FILE)   -
           PURGE                    -
           CLUSTER
 /*                                                              */
 /* DEFINE THE CICS DCS LOG FILE                                 */
 /*        FORMAT: ESDS                                          */
 /*        KEY   : NONE                                          */
 /*                                                              */
   DEFINE CLUSTER (                            -
              NAME (DCDT$AT.F01.LOG.FILE)      -
              CYLINDERS (1500 50)              -
              FREESPACE (0 0)                  -
              RECORDSIZE (80 1920)             -
              NONINDEXED                       -
              OWNER(DC01)                      -
              SHR (3)                          -
              SPEED                            -
                                               -
              ) -
          DATA (                               -
              NAME (DCDT$AT.F01.LOG.FILE.DATA) -
              CISZ (2048)                      -
              )
./       ADD   NAME=DEALER
//JONNALRI  JOB (TEST,DEV),'IDCAMS STUFF',CLASS=F,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   DEFINE DEALER VSAM FILE                                    *
//****************************************************************
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING DEALER FILE                              */
 /*                                                              */
   DELETE  (TCIP$DV.DEALER.PRIMARY)                   -
           PURGE                                 -
           CLUSTER
 /*                                                              */
 /* DEFINE THE DEALER FILE                                       */
   DEFINE  CLUSTER (NAME (TCIP$DV.DEALER.PRIMARY)      -
                    CYLINDERS (5 2)          -
                    FREESPACE (10 10)             -
                    INDEXED                       -
                    KEYS (5 0)                    -
                    RECORDSIZE (1500 1500)        -
                    SHAREOPTIONS (2)              -
                    SPEED                         -
                                      )
/*
//****************************************************************
//*   REPRO  DEALER VSAM FILE FROM PRODUCTION                    *
//****************************************************************
//STEP02 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=TCIP.DEALER.PRIMARY,
//            DISP=SHR
//DD2      DD DSN=TCIP$DV.DEALER.PRIMARY,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//
./       ADD   NAME=DEFGDGDM
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2412',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//JOBLIB    DD DSN=TEST.BATCH.LOAD,DISP=SHR
//          DD DSN=PROD.BATCH.LOAD,DISP=SHR
//*      DEFINE GDG FOR DATASETNAME AND CREATE DCB MODEL
//*
//GDG1   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  DEFINE GDG (NAME('VHDI$DV.TPM.SEND.FEATURES.BKUP') -
  NOEMPTY SCRATCH LIMIT(30))
/*
./       ADD   NAME=DFMCOPY
//JONNALRI  JOB (TEST,DEV),'IDCAMS STUFF',CLASS=F,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   DEFINE DEALER VSAM FILE                                    *
//****************************************************************
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING DEALER FILE                              */
 /*                                                              */
   DELETE  (TCIP$DV.DEALER.PRIMARY)                   -
           PURGE                                 -
           CLUSTER
 /*                                                              */
 /* DEFINE THE DEALER FILE                                       */
   DEFINE  CLUSTER (NAME (TCIP$DV.DEALER.PRIMARY)      -
                    CYLINDERS (5 2)          -
                    FREESPACE (10 10)             -
                    INDEXED                       -
                    KEYS (5 0)                    -
                    RECORDSIZE (1500 1500)        -
                    SHAREOPTIONS (2)              -
                    SPEED                         -
                                      )
/*
//****************************************************************
//*   REPRO  DEALER VSAM FILE FROM PRODUCTION                    *
//****************************************************************
//STEP02 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=TCIP.DEALER.PRIMARY,
//            DISP=SHR
//DD2      DD DSN=TCIP$DV.DEALER.PRIMARY,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//****************************************************************
//*   DEFINE LXDLR  VSAM FILE                                    *
//****************************************************************
//STEP05    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING COLOUR MASTER FILE                       */
 /*                                                              */
   DELETE  (TCIP$DV.LXDEALR.PRIMARY.FILE) -
           PURGE                                 -
           CLUSTER
 /*                                                              */
 /* DEFINE THE COLOUR FILE                                       */
   DEFINE  CLUSTER (NAME (TCIP$DV.LXDEALR.PRIMARY.FILE) -
                    CYLINDERS (2 1)          -
                    FREESPACE (10 10)             -
                    INDEXED                       -
                    KEYS (5 0)                    -
                    RECORDSIZE (1500 1500)        -
                    SHAREOPTIONS (2)              -
                    SPEED                         -
                                      )           -
           DATA (NAME (TCIP$DV.LXDEALR.PRIMARY.FILE.DATA) -
                    CISZ (4096)                   -
                 FREESPACE (0 0)  )               -
           INDEX (NAME (TCIP$DV.LXDEALR.PRIMARY.FILE.INDEX) )
/*
//****************************************************************
//*   REPRO COLOUR VSAM FILE FROM PRODUCTION                     *
//****************************************************************
//STEP06 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=TCIP.LXDEALR.PRIMARY.FILE,
//            DISP=SHR
//DD2      DD DSN=TCIP$DV.LXDEALR.PRIMARY.FILE,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//*
//STEP07    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING COLOUR MASTER FILE                       */
 /*                                                              */
   DELETE  (TCIP$DV.LXDEALRB.PRIMARY.AIX) -
           PURGE                   -
           AIX
 /*                                                              */
 /* DEFINE THE COLOUR FILE                                       */
   DEFINE  ALTERNATEINDEX ( NAME (TCIP$DV.LXDEALRB.PRIMARY.AIX) -
                             TRACKS (11 1)          -
                             IMBED                    -
                             KEYS (7 383)             -
                             UNIQUEKEY                -
                             RELATE (TCIP$DV.LXDEALR.PRIMARY.FILE) -
                             SPEED                    -
                             SHAREOPTIONS (4)         -
                             UPGRADE                  -
                                               )      -
           DATA  ( NAME (TCIP$DV.LXDEALRB.PRIMARY.AIX.DATA)    -
                   CISZ (4096) -
                   FREESPACE (0 0) )                  -
           INDEX ( NAME (TCIP$DV.LXDEALRB.PRIMARY.AIX.INDEX) -
                   CISZ (512) )
   DEFINE  PATH  ( NAME (TCIP$DV.LXDEALRB.PRIMARY.PATH) -
                   PATHENTRY (TCIP$DV.LXDEALRB.PRIMARY.AIX) -
                   UPDATE  )

   BLDINDEX  INDATASET  (TCIP$DV.LXDEALR.PRIMARY.FILE) -
             OUTDATASET  (TCIP$DV.LXDEALRB.PRIMARY.AIX)
//****************************************************************
//
./       ADD   NAME=DLRLEX
//JONNALRI  JOB (TEST,DEV),'IDCAMS STUFF',CLASS=A,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   DEFINE DEALER VSAM FILE                                    *
//****************************************************************
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING DEALER FILE                              */
 /*                                                              */
   DELETE  (TCIP$DV.DEALER.PRIMARY)                   -
           PURGE                                 -
           CLUSTER
 /*                                                              */
 /* DEFINE THE DEALER FILE                                       */
   DEFINE  CLUSTER (NAME (TCIP$DV.DEALER.PRIMARY)      -
                    CYLINDERS (5 2)          -
                    FREESPACE (10 10)             -
                    INDEXED                       -
                    KEYS (5 0)                    -
                    RECORDSIZE (1500 1500)        -
                    SHAREOPTIONS (2)              -
                    SPEED                         -
                                      )
/*
//****************************************************************
//*   REPRO  DEALER VSAM FILE FROM PRODUCTION                    *
//****************************************************************
//STEP02 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=TCIP.DEALER.PRIMARY,
//            DISP=SHR
//DD2      DD DSN=TCIP$DV.DEALER.PRIMARY,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//****************************************************************
//*   DEFINE LXDLR  VSAM FILE                                    *
//****************************************************************
//STEP05    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING COLOUR MASTER FILE                       */
 /*                                                              */
   DELETE  (TCIP$DV.LXDEALR.PRIMARY.FILE) -
           PURGE                                 -
           CLUSTER
 /*                                                              */
 /* DEFINE THE COLOUR FILE                                       */
   DEFINE  CLUSTER (NAME (TCIP$DV.LXDEALR.PRIMARY.FILE) -
                    CYLINDERS (2 1)          -
                    FREESPACE (10 10)             -
                    INDEXED                       -
                    KEYS (5 0)                    -
                    RECORDSIZE (1500 1500)        -
                    SHAREOPTIONS (2)              -
                    SPEED                         -
                                      )           -
           DATA (NAME (TCIP$DV.LXDEALR.PRIMARY.FILE.DATA) -
                    CISZ (4096)                   -
                 FREESPACE (0 0)  )               -
           INDEX (NAME (TCIP$DV.LXDEALR.PRIMARY.FILE.INDEX) )
/*
//****************************************************************
//*   REPRO COLOUR VSAM FILE FROM PRODUCTION                     *
//****************************************************************
//STEP06 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=TCIP.LXDEALR.PRIMARY.FILE,
//            DISP=SHR
//DD2      DD DSN=TCIP$DV.LXDEALR.PRIMARY.FILE,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//*
//STEP07    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING COLOUR MASTER FILE                       */
 /*                                                              */
   DELETE  (TCIP$DV.LXDEALRB.PRIMARY.AIX) -
           PURGE                   -
           AIX
 /*                                                              */
 /* DEFINE THE COLOUR FILE                                       */
   DEFINE  ALTERNATEINDEX ( NAME (TCIP$DV.LXDEALRB.PRIMARY.AIX) -
                             TRACKS (11 1)          -
                             IMBED                    -
                             KEYS (7 383)             -
                             UNIQUEKEY                -
                             RELATE (TCIP$DV.LXDEALR.PRIMARY.FILE) -
                             SPEED                    -
                             SHAREOPTIONS (4)         -
                             UPGRADE                  -
                                               )      -
           DATA  ( NAME (TCIP$DV.LXDEALRB.PRIMARY.AIX.DATA)    -
                   CISZ (4096) -
                   FREESPACE (0 0) )                  -
           INDEX ( NAME (TCIP$DV.LXDEALRB.PRIMARY.AIX.INDEX) -
                   CISZ (512) )
   DEFINE  PATH  ( NAME (TCIP$DV.LXDEALRB.PRIMARY.PATH) -
                   PATHENTRY (TCIP$DV.LXDEALRB.PRIMARY.AIX) -
                   UPDATE  )

   BLDINDEX  INDATASET  (TCIP$DV.LXDEALR.PRIMARY.FILE) -
             OUTDATASET  (TCIP$DV.LXDEALRB.PRIMARY.AIX)
//****************************************************************
//
./       ADD   NAME=EXPANDC
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=E,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//JOBLIB    DD DSN=TEST.BATCH.LOAD,DISP=SHR
//          DD DSN=PROD.BATCH.LOAD,DISP=SHR
//JCLPROC   JCLLIB ORDER=DEVT.LAWSON.PROCLIB
//COPYGET  EXEC PGM=IKJEFT01
//COPYLIBS DD *
PROD.BATCH.COPY
/*
//INFILE0  DD DSN=JONNALR.TEST.PROG(ACLA510B),DISP=SHR
//OUTFILE  DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSIN    DD DUMMY
//SYSTSIN  DD *
PROFILE NOPREFIX
EXEC 'JONNALR.CLIST(EXPANDC)'  'SUPPRESS=YES'
/*
//*
./       ADD   NAME=FMPRICE
//JONNALR1 JOB (TEST,DEV),'FMPRICE LOAD  ',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
//****************************************************************
//*   THIS JOB USES THE FILE MANAGER DB2 UTILITY TO COPY THE     *
//*   ABR VEHICLE COST OF SALES ROWS FROM PROD TO TEST.          *
//****************************************************************
//DLETFILE EXEC PGM=IEFBR14
//DD01     DD DSN=VHDI$DV.FMDB2.ABR.EXTRACT,
//            UNIT=TEST,SPACE=(TRK,(0)),DISP=(MOD,DELETE)
//*
//EXPORT   EXEC PGM=FMNDB2,PARM=('SSID=DSNP,SQID=DEVDBA')
//SYSPRINT DD SYSOUT=*
//FMNTSPRT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//FMNOUT   DD DSN=VHDI$DV.FMDB2.ABR.EXTRACT,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=TEST,
//            SPACE=(TRK,(20,10),RLSE),
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=0)
//SYSIN    DD *
$$FILEM DBX OBJIN="DTCCORP"."ABR_COST_PRICE",
$$FILEM TMIN=SHATTLA.FMDB2.STUFF(PRICING),
$$FILEM OUTPUT=FMNOUT,
$$FILEM NULLIND=_,
$$FILEM CSV=NO,
$$FILEM ROWS=ALL
//*
//*
//DLETCOS  EXEC SPUFI,DB2SYST=DSNT,SOUT=X,COND=(0,NE)
//SYSIN DD *

      DELETE  FROM
              DTCCORP.ABR_COST_PRICE

       WHERE  ABR_DLRSHP_CST_TYP IN ('FOB','EXG','DUT','MAR',
                                     'OCF','HAN','TDC','EXC',
                                     'DLN','DLT',
                                     'MRG','ADF','PLI','SEX',
                                     'INF','INT','LND','DLC')

/*
//*
//IMPORT   EXEC PGM=FMNDB2,PARM=('SSID=DBTB,SQID=DEVDBA'),COND=(0,NE)
//*STEPLIB DD DSN=FMN.SFMNMOD1,DISP=SHR
//SYSPRINT DD SYSOUT=*
//FMNTSPRT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSIN    DD *
$$FILEM DBI DSNIN=VHDI$DV.FMDB2.ABR.EXTRACT,
$$FILEM TCIN=SHATTLA.FMDB2.STUFF(PRICING),
$$FILEM OBJOUT="DTCCORP"."ABR_COST_PRICE",
$$FILEM UPDATE=YES,
$$FILEM DUPMAX=ALL,
$$FILEM DELROWS=NO,
$$FILEM ROWS=ALL
/*
./       ADD   NAME=GDGSTUFF
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//****************************************************************
//*   THIS JOB USES THE IDCAMS UTILITY TO DO NEAT STUFF LIKE     *
//*   DEFINE A GENERATION DATA GROUP (GDG).                      *
//****************************************************************
//BUDGIE    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
  DEFINE GDG (NAME (VHAC$DV.VHAC900R.TH1.DELETE) -
              LIMIT(3) -
              SCRATCH)
./       ADD   NAME=GMAC
//JONNALRS JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//*-------------------------------------------------------------------*
//*                                                                   *
//*                                                                   *
//*                                                                   *
//*                                                                   *
//*                                                                   *
//*                                                                   *
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V279,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=SHR
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=3720
//*
//
//STEP020 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V280,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=MOD
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=4542
//*
//STEP030 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V281,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=MOD
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=5116
//*
//STEP040 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V282,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=MOD
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=5154
//*
//STEP050 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V283,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=MOD
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=3807
//*
//STEP060 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V284,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=MOD
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=3347
//*
//STEP070 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V285,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=MOD
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=3101
//*
//STEP080 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V286,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=MOD
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=4619
//*
//STEP100 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V287,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=MOD
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=3914
//*
//STEP110 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V288,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=MOD
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=4760
//*
//STEP120 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V289,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=MOD
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=4890
//*
//STEP130 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V290,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=MOD
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=3996
//*
//STEP140 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V291,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=MOD
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=4456
//*
//STEP150 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V292,DISP=SHR
//SORTOUT   DD DSN=JONNALR.GMAC.REPORT,DISP=MOD
//SYSIN     DD *
 SORT FIELDS=COPY,
 SKIPREC=3040
//*
./       ADD   NAME=IBMCOMP
//JONNALRC JOB (TEST,DEV),'IBM COMP BTCHC2DB',
//          MSGLEVEL=(1,1),
//          NOTIFY=JONNALR,
//*         TYPRUN=SCAN,
//          MSGCLASS=X,
//          CLASS=A
//OUT1     OUTPUT FORMDEF=TLD260,PAGEDEF=TLX260, * 2 UP DUPLEX
//         CHARS=GT20,CLASS=X
//*OUT1     OUTPUT FORMDEF=TXSN6X,PAGEDEF=TLXX66, * 1UP SYMPLEX LAND
//*        CLASS=D
//*
//JOBLIB   DD DSN=SYS2.DB2.DSNT.SDSNLOAD,DISP=SHR
//*
//********************************************************************* 00010000
//*       DSNHCOB2 - COMPILE AND LINKEDIT A COBOL PROGRAM             * 00020000
//********************************************************************* 00010000
//*                                                                     00030000
//DSNHCOB2 PROC SCEELKED='SYS1.CEE.SCEELKED',
//            SDSNLOAD='SYS2.DB2.DSNT.SDSNLOAD',
//*****       DSNEXIT='SYS2.DB2.DSNT.SDSNEXIT',                         00100000
//            RESLIB='SYS2.IMS31.RESLIB',
//            WSPC=500,
//            MEM=TEMPNAME,
//            USER=USER,
//            OUTC='*',
//            LNGPRFX='IGY.V3R2M0',
//            SYSLBLK=3200
//*
//*
//********************************************************************* 00010000
//*            PRECOMPILE THE COBOL PROGRAM                           * 00060000
//********************************************************************* 00070000
//*
//PC       EXEC PGM=DSNHPC,PARM='HOST(IBMCOB)',REGION=8M                00080000
//DBRMLIB  DD DISP=SHR,DSN=&USER..DBRMLIB.DATA(&MEM)
//*STEPLIB  DD DISP=SHR,DSN=&DSNEXIT                                    00100000
//SYSCIN   DD DSN=&&DSNHOUT,DISP=(MOD,PASS),UNIT=SYSALLDA,              00120000
//            SPACE=(800,(&WSPC,&WSPC))                                 00130000
//SYSLIB   DD DISP=SHR,DSN=&USER..SRCLIB.DATA
//SYSPRINT DD SYSOUT=&OUTC                                              00150000
//SYSTERM  DD SYSOUT=*                                                  00160000
//SYSUDUMP DD SYSOUT=*                                                  00170000
//SYSUT1   DD SPACE=(800,(&WSPC,&WSPC),,,ROUND),UNIT=SYSALLDA           00180000
//SYSUT2   DD SPACE=(800,(&WSPC,&WSPC),,,ROUND),UNIT=SYSALLDA           00190000
//*                                                                     00200000
//*********************************************************************
//*
//COB    EXEC PGM=IGYCRCTL,REGION=2048K
//STEPLIB  DD  DSNAME=&LNGPRFX..SIGYCOMP,
//             DISP=SHR
//SYSPRINT DD  DSN=DEVT.PROGRAM.LISTING(&MEM),DISP=SHR
//SYSIN    DD DSN=&&DSNHOUT,DISP=(OLD,DELETE)                           00250000
//SYSDEBUG DD DSN=DEVT.BATCH.SYSDEBUG(&MEM),DISP=SHR
//*YSDEBUG DD DSN=SYST.IDI.HIST.TEST.BATCH(&MEM),DISP=SHR
//SYSLIN   DD  DSNAME=&&LOADSET,UNIT=SYSDA,
//             DISP=(MOD,PASS),SPACE=(TRK,(3,3)),
//             DCB=(BLKSIZE=&SYSLBLK)
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT4   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT5   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT6   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT7   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//*                                                                     00200000
//*********************************************************************
//*     PRINT COMPILE LISTING                                         *
//*********************************************************************
//*
//PRINT    EXEC PGM=IEBGENER,COND=(4,GE,COB)
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=*.COB.SYSPRINT,DISP=(OLD,PASS)       <== WAS COB2
//SYSUT2   DD SYSOUT=&OUTC
//SYSIN    DD DUMMY
//*
//*********************************************************************
//*     LINKEDIT OBJECT MODULE                                        *
//*********************************************************************
//*
//LKED     EXEC PGM=IEWL,PARM='LIST,XREF,LET,MAP',
//            COND=((4,LT,COB),(4,LT,PC))                               00440000
//SYSLIB   DD DISP=SHR,DSN=&SCEELKED
//         DD DISP=SHR,DSN=&SDSNLOAD
//         DD DISP=SHR,DSN=&RESLIB
//SYSLMOD  DD DISP=SHR,DSN=&USER..RUNLIB.LOAD(&MEM)
//SYSLIN   DD DSN=&&LOADSET,DISP=(OLD,DELETE)
//         DD DDNAME=SYSIN
//SYSPRINT DD SYSOUT=&OUTC
//SYSUDUMP DD SYSOUT=*
//SYSUT1   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//*
//     PEND                                                             00010000
//*******************************************************************
//*                                                                 *
//*        COMPILE/LINK BATCH COBOL II DB2 PROGRAM ACLA110B         *
//*                                                                 *
//*******************************************************************
//ACLA110B EXEC DSNHCOB2,
//          OUTC='(,),OUTPUT=*.OUT1',
// USER=TEST,MEM=ACLA110B,
//         LNGPRFX='SYS1.COB',
// PARM.PC='HOST(IBMCOB),APOST,APOSTSQL,DATE(ISO),TIME(JIS)',
// PARM.COB='SOURCE,LIB,MAP,XREF,LIST,TEST(NONE,SYM,SEPARATE)',
// REGION=2M
//PC.DBRMLIB DD DSN=&DBRMLIB(ACLA110B),DISP=(,PASS),
//      UNIT=SYSDA,SPACE=(TRK,(10,1,1),RLSE),
//      DCB=(RECFM=FB,LRECL=80,BLKSIZE=4800,DSORG=PO)
//PC.SYSLIB  DD DSN=ACPT.BATCH.COPY,DISP=SHR
//           DD DSN=PROD.BATCH.COPY,DISP=SHR
//           DD DSN=PROD.BATCH.COPY,DISP=SHR
//PC.SYSIN   DD DSN=ACPT.BATCH.COBOL(ACLA110B),DISP=SHR
//COB.SYSLIB  DD DSN=ACPT.BATCH.COPY,DISP=SHR
//            DD DSN=PROD.BATCH.COPY,DISP=SHR
//            DD DSN=PROD.BATCH.COPY,DISP=SHR
//LKED.SYSLIB DD DSN=SYS1.CEE.SCEELKED,DISP=SHR
//            DD DSN=SYS2.DB2.DSNT.SDSNLOAD,DISP=SHR
//LKED.SYSLMOD DD DSN=TEST.BATCH.LOAD,DISP=SHR
//LKED.SYSIN DD *
  INCLUDE SYSLIB(DSNELI)
  INCLUDE INCLIB(TCITIARB)
  NAME ACLA110B(R)
/*
//LKED.INCLIB  DD DSN=TEST.BATCH.LOAD,DISP=SHR
//             DD DSN=PROD.BATCH.LOAD,DISP=SHR
//*
//*
//*********************************************************************
//****  COPY DBRM MEMBERS INTO TARGET LIBRARY                   ****
//*********************************************************************
//COPYDBRM  EXEC  PGM=IEBCOPY,COND=(4,LT)
//STEPLIB  DD    DSN=SYS4.PROD.LOAD,DISP=SHR
//SYSPRINT DD    SYSOUT=*
//FROMDBRM    DD  DSN=&DBRMLIB,DISP=(OLD,DELETE)
//TODBRM      DD DSN=DEVT.DB2.DBRMLIB,DISP=SHR
//SYSIN    DD    *
 COPY INDD=((FROMDBRM,R)),OUTDD=TODBRM
 S M=ACLA110B
//*
./       ADD   NAME=IDCAMS
//JONNALRI  JOB (TEST,DEV),'IDCAMS STUFF',CLASS=A,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   THIS JOB USES THE IDCAMS UTILITY TO DO NEAT STUFF LIKE     *
//*   DEFINE A VSAM FILE.                                        *
//****************************************************************
//BUDGIE    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /*                                                              */
 /* DEFINE THE COPY OF ZONE PRODUCTION ORDER FILE ALTERNATE INDEX*/
 /*        FORMAT: KSDS                                          */
 /*           KEY: PRODUCTION MONTH                              */
 /*                ZONE                                          */
 /*                SERIES                                        */
 /*                MODEL                                         */
 /*                COLOUR                                        */
 /*                SFX                                           */
 /*                SOURCE                                        */
 /*                REQUESTED BUILD DATE                          */
 /*                DEALER CODE                                   */
 /*   RECORD SIZE: ( 5 + AIX-LEN + PRIME-LEN * OCCURENCES)       */
 /*                =  5 + 35 + (16 * 1500)                       */
 /*                =  24040                                      */
 /*                                                              */
   DEFINE ALTERNATEINDEX ( -
              NAME (ACLA$DV.DIS.F9CC.ZONE.PROD.ORDER.AIX) -
              RELATE (ACLA$DV.DIS.F9C.ZONE.PROD.ORDER.FILE) -
              OWNER (VOAS) -
              CYLINDERS (13 2) -
              FREESPACE (10 10) -
              NONUNIQUEKEY -
              KEYS (35 51) -
              RECORDSIZE (56 24040) -
              SHR (4) -
              SPEED -
                               -
              )
 /*                                                              */
 /* DEFINE THE ZONE PRODUCTION ORDER FILE ALTERNATE PATH         */
 /*                                                              */
    DEFINE PATH ( -
               NAME (ACLA$DV.DIS.F9CC.ZONE.PROD.ORDER.PATH) -
               PATHENTRY (ACLA$DV.DIS.F9CC.ZONE.PROD.ORDER.AIX) -
               )

    BLDINDEX -
               INDATASET (ACLA$DV.DIS.F9C.ZONE.PROD.ORDER.FILE) -
               OUTDATASET (ACLA$DV.DIS.F9CC.ZONE.PROD.ORDER.AIX)
/*
    LISTC ENT(VHOM.VHOM430B.BKUP) ALL
/*
    DELETE (VHOA$AT.DIS.F10.NATION.PROD.ORDER.FILE) PURGE
/*
    DELETE (CONV.WTYVHD) PURGE
    DELETE (CONV.WTYVHI) PURGE
/*
    PRINT INFILE(VSAMFILE)
/*
    PRINT INDATASET('ACAP.F02.VCHRAUDT')
/*
  DELETE (VHDI$DV.VEHICLE.SALES.AUDIT97)
/*
    DELETE    (ECAG$AT.F02B.AGREE.FILE.PATH)                    -       00049005
              PURGE                                             -       00050004
              CLUSTER                                                   00051001
/*
./       ADD   NAME=IEBGENER
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2412',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
//***
//CLEANUP  EXEC  PGM=IEFBR14
//DEL001     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V276,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL002     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V277,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL003     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V278,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL004     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V279,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL005     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V280,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL006     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V281,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL007     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V282,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL008     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V283,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL009     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V284,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL010     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V285,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL011     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V286,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL012     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V287,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL013     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V288,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL014     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V289,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL015     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V290,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL016     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V291,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL017     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V292,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL018     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V293,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL019     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V276,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL020     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V277,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL021     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V278,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL022     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V279,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL023     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V280,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL024     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V281,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL025     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V282,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL026     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V283,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL027     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V284,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL028     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V285,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL029     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V286,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL030     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V287,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL031     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V288,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL032     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V289,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL033     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V290,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL034     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V291,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL035     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V292,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL036     DD    DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V293,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//***
//****************************************************************
//*   THIS JOB USES THE IEBGENER UTILITY TO COPY SOMETHING       *
//*   TO SOMETHING ELSE.                                         *
//****************************************************************
//*
//STEP01   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V276,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP02   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0277V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V277,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP03   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0278V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V278,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP04   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0279V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V279,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP05   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0280V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V280,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP06   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0281V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V281,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP07   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0282V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V282,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP08   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0283V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V283,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP09   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0284V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V284,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP10   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0285V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V285,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP11   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0286V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V286,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//STEP12   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0287V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V287,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//STEP13   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0288V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V288,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//STEP14   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0289V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V289,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//STEP15   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0290V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V290,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//STEP16   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0291V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V291,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//STEP17   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0292V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V292,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//STEP18   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.TOYOTA.G0293V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.TOYOTA.V293,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.TOYOTA.G0276V00
//SYSIN     DD DUMMY
//*
//****************************************************************
//*   THIS JOB USES THE IEBGENER UTILITY TO COPY SOMETHING       *
//*   TO SOMETHING ELSE.                                         *
//****************************************************************
//*
//STEP01   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V276,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP02   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0277V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V277,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP03   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0278V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V278,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP04   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0279V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V279,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP05   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0280V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V280,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP06   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0281V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V281,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP07   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0282V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V282,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP08   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0283V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V283,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP09   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0284V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V284,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP10   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0285V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V285,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//*
//STEP11   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0286V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V286,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//STEP12   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0287V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V287,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//STEP13   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0288V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V288,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//STEP14   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0289V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V289,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//STEP15   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0290V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V290,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//STEP16   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0291V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V291,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//STEP17   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0292V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V292,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
//STEP18   EXEC PGM=IEBGENER
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSUT1    DD DSN=VHDI.NVEH0660.SCOTIA.LEXUS.G0293V00,
//             DISP=SHR
//SYSUT2    DD DSN=VHDI$DV.NVEH0660.SCOTIA.LEXUS.V293,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=TEST,
//             SPACE=(TRK,(01,01),RLSE),
//             LIKE=VHDI.NVEH0660.SCOTIA.LEXUS.G0276V00
//SYSIN     DD DUMMY
//*
./       ADD   NAME=IEFBR14
//JONNALRI  JOB (TEST,DEV),'IEFBR14 STUFF',CLASS=A,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   THIS JOB USES THE IEFBR14 UTILITY TO DELETE SEQUENTIAL     *
//*   FILES BEFORE A JOB IS RE-RUN.                              *
//****************************************************************
//DLETFILE  EXEC PGM=IEFBR14
//DD01      DD DSN=JONNALR.SALES.FILE.ADEM0090.A0091,
//             UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD02      DD DSN=JONNALR.SALES.FILE.ADEM0091.A0105,
//             UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
./       ADD   NAME=IEHPROG
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//JOBLIB    DD DSN=TEST.BATCH.LOAD,DISP=SHR
//          DD DSN=PROD.BATCH.LOAD,DISP=SHR
//STEP1 EXEC PGM=IEHPROGM
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
 RENAME  DSNAME=JONNALR.TEST.PDS,                                      X
               MEMBER=DEMO1,NEWNAME=DEMOA
/*
./       ADD   NAME=IMAGCOPY
//JONNALR1 JOB (0803,VHDI),'IMAGECOPY',
//*        TYPRUN=HOLD,
//*        RESTART=DBCICFUL.STEP020,
//         MSGLEVEL=(1,1),
//         NOTIFY=SCHNITP,
//         MSGCLASS=X,
//         CLASS=P,
//         USER=TOYDBA
//OUT OUTPUT FORMDEF=TLSL60,PAGEDEF=TLXX60
//*PROCLIB  JCLLIB ORDER=(DEVT.DB2.PROC.WORK)
/*JOBPARM  PROCLIB=PROD
//********************************************************************
//*     IMAGECOPY
//********************************************************************
//DBCICFUL EXEC DBCICFUL,
//*         UTPROC='RESTART(PHASE)',
//          APPL='VHDB',
//          DB='DTCCORP',
//          TS1=SVHMDABG,
//          UID='DBVH2ABG',
//          PROD=PROD,
//          DB2SYST=DSNP,
//          ODSNSPC='CYL,(20,10)',
//          MDTS='DBVHABGM',
//          ICTS='DBVHABGF'
//STEP020.SYSIN DD DSN=JONNALR.TEST.COPY(DBVHABGF),DISP=SHR
//STEP040.SYSIN DD DSN=JONNALR.TEST.COPY(DBVHABGM),DISP=SHR
./       ADD   NAME=INFOPAC
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR,TYPRUN=SCAN
/*JOBPARM SYSAFF=TOYB
//JOBLIB    DD DSN=TEST.BATCH.LOAD,DISP=SHR
//          DD DSN=PROD.BATCH.LOAD,DISP=SHR
//JCLPROC   JCLLIB ORDER=DEVT.LAWSON.PROCLIB
//***********************************************************
//*  PRINT ON REQUEST ZONE MARKET SHARE REPORT TO INFOPAC
//***********************************************************
//STEP020 EXEC PGM=SORTGENR,REGION=1024K,COND=(0,NE)
//SYSUT1    DD DSN=PCDM$DV.PCDM600B.ERRREPT,DISP=SHR
//SYSUT2    DD SYSOUT=S,RECFM=FBA
//SYSPRINT  DD SYSOUT=*
./       ADD   NAME=LDPAP201
//JONNALRL JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//****************************************************************
//*   THIS JOB USES THE DB2 UTILITY WITH SQL TO EXTRACT SELECTED *
//*   TABLES FROM PRODUCTION AND LOAD THEM TO TEST.              *
//*   LOAD DATA LOG NO RESUME YES NOCOPYPEND INDDN SYSREC00 INTO TABLE
//****    DACACCT.VHO_DEMO_FCT_OPT *******************************
//********************************************************************
//*            LOAD THE TABLE
//********************************************************************
//LOAD1   EXEC DSNUPROC,SYSTEM=DSNT,UID='LOADPRC',UTPROC='',COND=(7,LT)
//*
//DSNUPROC.SYSREC00 DD DSN=JONNALR.UNLOAD.SYSREC.TN,
//             DISP=SHR
//DSNUPROC.SORTWK01 DD DSN=&&SORTWK01,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SORTWK02 DD DSN=&&SORTWK02,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SORTWK03 DD DSN=&&SORTWK03,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SORTWK04 DD DSN=&&SORTWK04,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SYSMAP   DD DSN=&&SMAPT,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(300,80),RLSE),
//             UNIT=SYSDA
//DSNUPROC.SYSUT1   DD DSN=&&SYSUT1,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(400,100),RLSE),
//             UNIT=SYSDA
//DSNUPROC.SORTOUT  DD DSN=&&SORTOUT,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(400,100),RLSE),
//             UNIT=SYSDA
//DSNUPROC.SYSIN    DD DSN=JONNALR.UNLOAD.SYSPUNCH.T,DISP=SHR
//*
//
./       ADD   NAME=LDTEST
//JONNALRL JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//****************************************************************
//*   THIS JOB USES THE DB2 UTILITY WITH SQL TO EXTRACT SELECTED *
//*   TABLES FROM PRODUCTION AND LOAD THEM TO TEST.              *
//*   LOAD DATA LOG NO RESUME YES NOCOPYPEND INDDN SYSREC00 INTO TABLE
//*   LOAD DATA LOG NO REPLACE NOCOPYPEND INDDN SYSREC00 INTO TABLE
//*   LOAD DATA LOG NO RESUME YES ENFORCE NO
//*   NOCOPYPEND INDDN SYSREC00 INTO TABLE
//*   LOAD DATA LOG NO REPLACE ENFORCE NO
//*   NOCOPYPEND INDDN SYSREC00 INTO TABLE
//****    DACACCT.VHO_DEMO_FCT_OPT *******************************
//********************************************************************
//*            LOAD THE TABLE
//********************************************************************
//LOAD1   EXEC DSNUPROC,SYSTEM=DSNT,UID='LOADPRC',UTPROC='',COND=(7,LT)
//*
//DSNUPROC.SYSREC00 DD DSN=JONNALR.UNLOAD.SYSREC,
//             DISP=SHR
//DSNUPROC.SORTWK01 DD DSN=&&SORTWK01,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SORTWK02 DD DSN=&&SORTWK02,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SORTWK03 DD DSN=&&SORTWK03,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SORTWK04 DD DSN=&&SORTWK04,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SYSMAP   DD DSN=&&SMAPT,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(300,80),RLSE),
//             UNIT=SYSDA
//DSNUPROC.SYSUT1   DD DSN=&&SYSUT1,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(400,100),RLSE),
//             UNIT=SYSDA
//DSNUPROC.SORTOUT  DD DSN=&&SORTOUT,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(400,100),RLSE),
//             UNIT=SYSDA
//DSNUPROC.SYSIN    DD DSN=JONNALR.UNLOAD.SYSPUNCH,DISP=SHR
//*
//
./       ADD   NAME=LISTCAT
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
//LISTCAT EXEC PGM=IDCAMS,REGION=1024K
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
   LISTCAT ENTRIES(VHDI$DV.MODEL.MASTER) ALL
/*
//
./       ADD   NAME=MODLOPTN
//JONNALRI  JOB (TEST,DEV),'IDCAMS STUFF',CLASS=A,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   DEFINE MODEL VSAM FILE                                     *
//****************************************************************
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING MODEL FILE                               */
 /*                                                              */
    DELETE (VHDI$DV.MODEL.MASTER)      -
           PURGE                         -
           CLUSTER
 /*                                                              */
 /* DEFINE THE MODEL FILE                                        */
   DEFINE  CLUSTER (NAME (VHDI$DV.MODEL.MASTER)       -
                    TRACKS (40 4)                 -
                    FREESPACE (0 0)               -
                    INDEXED                       -
                    KEYS (9 0)                    -
                    RECORDSIZE (1017 1017)        -
                    SHAREOPTIONS (2)              -
                    SPEED                         -
                                      )
/*
//****************************************************************
//*   REPRO  MODEL VSAM FILE FROM PRODUCTION                     *
//****************************************************************
//STEP02 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=VHDI.MODEL.MASTER,
//            DISP=SHR
//DD2      DD DSN=VHDI$DV.MODEL.MASTER,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//****************************************************************
//*   DEFINE OPTION VSAM FILE                                    *
//****************************************************************
//STEP03    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING OPTION MASTER FILE                       */
 /*                                                              */
    DELETE (VHDI$DV.OPTION.MASTER)     -
           PURGE                         -
           CLUSTER
 /*                                                              */
 /* DEFINE THE OPTION FILE                                       */
   DEFINE  CLUSTER (NAME (VHDI$DV.OPTION.MASTER)       -
                    TRACKS (30 3)                  -
                    FREESPACE (0 0)                -
                    INDEXED                        -
                    KEYS (6 0)                     -
                    RECORDSIZE (350 350)           -
                    SHAREOPTIONS (2)               -
                    SPEED                          -
                                      )
/*
//****************************************************************
//*   REPRO OPTION VSAM FILE FROM PRODUCTION                     *
//****************************************************************
//STEP04 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=VHDI.OPTION.MASTER,
//            DISP=SHR
//DD2      DD DSN=VHDI$DV.OPTION.MASTER,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//
//
//****************************************************************
//*   THIS JOB USES THE DB2 UTILITY WITH SQL TO EXTRACT SELECTED *
//*   TABLES FROM PRODUCTION                                     *
//****************************************************************
//ERASE EXEC PGM=IEFBR14,DYNAMNBR=80,REGION=2048K
//DD01    DD DSN=JONNALR.UNLOAD.SYSREC.ABR,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD01B   DD DSN=JONNALR.UNLOAD.SYSPUNCH.ABR,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//*
//********************************************************************
//*            JOB NUMBER : DSNTIAUL WITH PARM('SQL')
//*            FUNCTIONS  : EXTRACT SPECIFIED RECORDS
//********************************************************************
//UNLOAD1  EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DSN=PROD.DB2.COMMANDS(#RUNDSNP),DISP=SHR
//         DD DSN=PROD.DB2.COMMANDS(#INDSNP),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSREC00 DD DSN=JONNALR.UNLOAD.SYSREC.ABR,
//            DISP=(,CATLG,DELETE),UNIT=SYSALLDA,SPACE=(CYL,(20,10))
//SYSPUNCH DD DSN=JONNALR.UNLOAD.SYSPUNCH.ABR,
//            DISP=(,CATLG,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(1,1))
//SYSIN    DD *
   SELECT * FROM  DTCCORP.ABR_COST_PRICE ;
/*
//*
//****************************************************************
//*   THIS JOB USES THE DB2 UTILITY WITH SQL TO EXTRACT SELECTED *
//*   TABLES FROM PRODUCTION                                     *
//****************************************************************
//ERASE EXEC PGM=IEFBR14,DYNAMNBR=80,REGION=2048K
//DD01    DD DSN=JONNALR.UNLOAD.SYSREC.ABP,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD01B   DD DSN=JONNALR.UNLOAD.SYSPUNCH.ABP,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//*
//********************************************************************
//*            JOB NUMBER : DSNTIAUL WITH PARM('SQL')
//*            FUNCTIONS  : EXTRACT SPECIFIED RECORDS
//********************************************************************
//UNLOAD1  EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DSN=PROD.DB2.COMMANDS(#RUNDSNP),DISP=SHR
//         DD DSN=PROD.DB2.COMMANDS(#INDSNP),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSREC00 DD DSN=JONNALR.UNLOAD.SYSREC.ABP,
//            DISP=(,CATLG,DELETE),UNIT=SYSALLDA,SPACE=(CYL,(20,10))
//SYSPUNCH DD DSN=JONNALR.UNLOAD.SYSPUNCH.ABP,
//            DISP=(,CATLG,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(1,1))
//SYSIN    DD *
   SELECT * FROM  DTCCORP.ABP_DLR_COST_TYPE ;
/*
//*
//****************************************************************
//*   THIS JOB USES THE DB2 UTILITY WITH SQL TO EXTRACT SELECTED *
//*   TABLES FROM PRODUCTION                                     *
//****************************************************************
//ERASE EXEC PGM=IEFBR14,DYNAMNBR=80,REGION=2048K
//DD01    DD DSN=JONNALR.UNLOAD.SYSREC.BPG,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD01B   DD DSN=JONNALR.UNLOAD.SYSPUNCH.BPG,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//*
//********************************************************************
//*            JOB NUMBER : DSNTIAUL WITH PARM('SQL')
//*            FUNCTIONS  : EXTRACT SPECIFIED RECORDS
//********************************************************************
//UNLOAD1  EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DSN=PROD.DB2.COMMANDS(#RUNDSNP),DISP=SHR
//         DD DSN=PROD.DB2.COMMANDS(#INDSNP),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSREC00 DD DSN=JONNALR.UNLOAD.SYSREC.BPG,
//            DISP=(,CATLG,DELETE),UNIT=SYSALLDA,SPACE=(CYL,(20,10))
//SYSPUNCH DD DSN=JONNALR.UNLOAD.SYSPUNCH.BPG,
//            DISP=(,CATLG,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(1,1))
//SYSIN    DD *
   SELECT * FROM  DVHDIST.BPG_MODEL_SOURCE ;
/*
//*
//
//****************************************************************
//*   THIS JOB USES THE DB2 UTILITY WITH SQL TO EXTRACT SELECTED *
//*   TABLES FROM PRODUCTION AND LOAD THEM TO TEST.              *
//*   LOAD DATA LOG NO RESUME YES NOCOPYPEND INDDN SYSREC00 INTO TABLE
//****    DACACCT.VHO_DEMO_FCT_OPT *******************************
//********************************************************************
//*            LOAD THE TABLE
//********************************************************************
//LOAD1   EXEC DSNUPROC,SYSTEM=DSNT,UID='LOADABR',UTPROC='',COND=(7,LT)
//*
//DSNUPROC.SYSREC00 DD DSN=JONNALR.UNLOAD.SYSREC.ABR,
//             DISP=SHR
//DSNUPROC.SORTWK01 DD DSN=&&SORTWK01,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SORTWK02 DD DSN=&&SORTWK02,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SORTWK03 DD DSN=&&SORTWK03,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SORTWK04 DD DSN=&&SORTWK04,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(220,220),,,ROUND),
//             UNIT=SYSDA
//DSNUPROC.SYSMAP   DD DSN=&&SMAPT,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(300,80),RLSE),
//             UNIT=SYSDA
//DSNUPROC.SYSUT1   DD DSN=&&SYSUT1,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(400,100),RLSE),
//             UNIT=SYSDA
//DSNUPROC.SORTOUT  DD DSN=&&SORTOUT,
//             DISP=(NEW,DELETE),
//             SPACE=(CYL,(400,100),RLSE),
//             UNIT=SYSDA
//DSNUPROC.SYSIN    DD DSN=JONNALR.UNLOAD.SYSPUNCH.ABR,DISP=SHR
//*
//
./       ADD   NAME=PRODSPUF
//JONNALR1  JOB (TEST,DEV),'DB2 SPUFI STUFF',CLASS=F,
//          USER=DEVDBA,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   THIS JOB EXECUTES THE SPUFI UTILITY TO FIDDLE WITH         *
//*   SOME STUFF ON DB2 TABLES.                                  *
//****************************************************************
//JCLPROC JCLLIB ORDER=SYS4.PRODPROC
//STEP010  EXEC SPUFI,DB2SYST=DSNP,SOUT=X
//SPUFI.SYSIN DD *

    SELECT
             V9_WMI
         ||  V9_VDS
         ||  V9_CHECK_DIGIT
         ||  V9_YEAR
         ||  V9_PLANT
         ||  V9_SERIAL
            ,V9_DEALER
            ,V9_PROCESS_DATE
            ,V9_VEH_OWNR_NO
            ,V9_SALES_TYPE
            ,V9_OWNR_POSTAL_CDE
            ,V9_LESSEE_POST_CDE
            ,D1_FIRST_RETL_OWNR
            ,D1_SERIES
            ,D1_MODEL_VDS
         ||  D1_TRANSMISSION
         ||  D1_REVISION
            ,'D1'

       FROM
             DVHDIST.TD1_VEH_ORDER
            ,DTCCORP.TV9_VEH_OWNER_HIST
      WHERE
             D1_WMI                 = V9_WMI
         AND D1_VDS                 = V9_VDS
         AND D1_CHECK_DIGIT         = V9_CHECK_DIGIT
         AND D1_YEAR                = V9_YEAR
         AND D1_PLANT               = V9_PLANT
         AND D1_SERIAL              = V9_SERIAL
         AND D1_FIRST_RETL_OWNR     = V9_VEH_OWNR_NO
         AND V9_PROCESS_DATE       >= '2006-09-16'
         AND V9_PROCESS_DATE       <= '2006-09-30'

 UNION

    SELECT
             V9_WMI
         ||  V9_VDS
         ||  V9_CHECK_DIGIT
         ||  V9_YEAR
         ||  V9_PLANT
         ||  V9_SERIAL
            ,V9_DEALER
            ,V9_PROCESS_DATE
            ,V9_VEH_OWNR_NO
            ,V9_SALES_TYPE
            ,V9_OWNR_POSTAL_CDE
            ,V9_LESSEE_POST_CDE
            ,V6_FIRST_RETL_OWNR
            ,V6_SERIES
            ,V6_MODEL_VDS
         ||  V6_TRANSMISSION
         ||  V6_REVISION
            ,'V6'

       FROM
             DTCCORP.TV6_VEH_HIST
            ,DTCCORP.TV9_VEH_OWNER_HIST
      WHERE
             V6_WMI                 = V9_WMI
         AND V6_VDS                 = V9_VDS
         AND V6_CHECK_DIGIT         = V9_CHECK_DIGIT
         AND V6_YEAR                = V9_YEAR
         AND V6_PLANT               = V9_PLANT
         AND V6_SERIAL              = V9_SERIAL
         AND V6_FIRST_RETL_OWNR     = V9_VEH_OWNR_NO
         AND V9_PROCESS_DATE       >= '2006-09-16'
         AND V9_PROCESS_DATE       <= '2006-09-30'


./       ADD   NAME=PROQUEST
//JONNALRS JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//****************************************************************
//*-------------------------------------------------------------------*
//*- SORT AND ELIMINATE DUPLICATE VINS
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTWK01 DD SPACE=(CYL,(100)),UNIT=TEST
//SORTWK02 DD SPACE=(CYL,(300)),UNIT=TEST
//SORTWK03 DD SPACE=(CYL,(300)),UNIT=TEST
//SORTWK04 DD SPACE=(CYL,(300)),UNIT=TEST
//SORTIN    DD DSN=VHOM$DV.PROQUEST.VINS.D060620,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D060716,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D060816,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D060916,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D061016,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D061116,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D061216,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070116,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070216,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070316,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070319,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070323,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070416,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070516,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070616,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D1998,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D1999,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2000,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2001,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2002,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2003,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2004,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2005,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2006,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2007,DISP=SHR
//SORTOUT   DD DSN=VHOM$DV.PROQUEST.VINS.SENT,DISP=SHR
//SYSIN     DD *
 SORT FIELDS=(1,17,CH,A)
 SUM FIELDS=NONE
//*
//****************************************************************
//*   DEFINE PROQUEST VSAM FILE                                  *
//****************************************************************
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING PROQUEST FILE                            */
 /*                                                              */
    DELETE (VHOM$DV.PROQUEST.MASTER)   -
           PURGE                         -
           CLUSTER
 /*                                                              */
 /* DEFINE THE PROQUEST FILE                                     */
   DEFINE  CLUSTER (NAME (VHOM$DV.PROQUEST.MASTER)    -
                    TRACKS (200 10)               -
                    FREESPACE (0 0)               -
                    INDEXED                       -
                    KEYS (17 0)                   -
                    RECORDSIZE (135 135)          -
                    SHAREOPTIONS (2)              -
                    SPEED                         -
                                      )
/*
//****************************************************************
//*   REPRO  PROQUEST VSAM FILE FROM PRODUCTION                  *
//****************************************************************
//STEP02 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=VHOM$DV.PROQUEST.VINS.SENT,
//            DISP=SHR
//DD2      DD DSN=VHOM$DV.PROQUEST.MASTER,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//*
//
//*-------------------------------------------------------------------*
//*- SORT AND ELIMINATE DUPLICATE VINS
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTWK01 DD SPACE=(CYL,(100)),UNIT=TEST
//SORTWK02 DD SPACE=(CYL,(300)),UNIT=TEST
//SORTWK03 DD SPACE=(CYL,(300)),UNIT=TEST
//SORTWK04 DD SPACE=(CYL,(300)),UNIT=TEST
//SORTIN    DD DSN=VHOM$DV.PROQUEST.TCV701.D00,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D01,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D02,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D03,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D04,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D05,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D06,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D07,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D98,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D99,DISP=SHR
//SORTOUT   DD DSN=VHOM$DV.PROQUEST.TCV701.SRT,DISP=SHR
//SYSIN     DD *
 SORT FIELDS=(1,17,CH,A)
 SUM FIELDS=NONE
//
//****************************************************************
//*   DEFINE TCV701   VSAM FILE                                  *
//****************************************************************
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING PROQUEST FILE                            */
 /*                                                              */
    DELETE (VHOM$DV.PROQUEST.TCV701)   -
           PURGE                         -
           CLUSTER
 /*                                                              */
 /* DEFINE THE PROQUEST FILE                                     */
   DEFINE  CLUSTER (NAME (VHOM$DV.PROQUEST.TCV701)    -
                    TRACKS (200 10)               -
                    FREESPACE (0 0)               -
                    INDEXED                       -
                    KEYS (17 0)                   -
                    RECORDSIZE (212 212)          -
                    SHAREOPTIONS (2)              -
                    SPEED                         -
                                      )
/*
//****************************************************************
//*   REPRO  PROQUEST VSAM FILE FROM PRODUCTION                  *
//****************************************************************
//STEP02 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=VHOM$DV.PROQUEST.TCV701.SRT,
//            DISP=SHR
//DD2      DD DSN=VHOM$DV.PROQUEST.TCV701,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//*
//
./       ADD   NAME=PRTINV5
//JONNALRP  JOB (TEST,DEV),'PRINT VEH INVOICES',CLASS=E,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   THIS JOB IS RUN ON REQUEST TO REPRINT THE ACCOUNTS         *
//*   RECEIVABLE COPY OF THE VEHICLE INVOICES.                   *
//****************************************************************
//*   NOTE: THIS IS STEP115 FROM JOB VHDI190M.                   *
//*   ====  IT PRINTS INVOICES FOR TOYOTA DEMO VEHICLES.         *
//****************************************************************
//*
//*********************************************************************
//*                                                                   *
//*  PRINT THE LEXUS INVOICES FOR NON-SCOTIA (NON-CIBC, NON-TFS TOO)  *
//*                                                                   *
//*********************************************************************
//STEP100 EXEC PGM=IEBGENER,COND=(0,NE),
//             REGION=1024K
//*********************************************************************
//SYSPRINT  DD SYSOUT=X
//SYSUT1    DD DSN=VHDI.NVEH0660.NON.SCOTIA.LEXUS(0),
//             DISP=SHR
//OUT1     OUTPUT FORMDEF=INV5A,PAGEDEF=INV5,CHARS=GT10
//OUT2     OUTPUT FORMDEF=INV5B,PAGEDEF=INV5,CHARS=GT10
//OUT3     OUTPUT FORMDEF=INV5C,PAGEDEF=INV5,CHARS=GT10
//SYSUT2   DD SYSOUT=(H,,LXI5),
//            OUTPUT=(*.OUT1,*.OUT2)
//SYSIN     DD DUMMY
//
//*********************************************************************
//*                                                                   *
//*   STEP115 PRINTS THE TOYOTA DEMO VEHICLE INVOICES FOR ACCOUNTING. *
//*                                                                   *
//*********************************************************************
//STEP115 EXEC PGM=SORTGENR,COND=(0,NE),
//             REGION=2048K
//********************************************************************* 00008023
//OUT1     OUTPUT FORMDEF=INV5B,PAGEDEF=INV5,CHARS=GT10
//OUT2     OUTPUT FORMDEF=INV5E,PAGEDEF=INV5,CHARS=GT10
//OUT3     OUTPUT FORMDEF=INV5H,PAGEDEF=INV5,CHARS=GT10
//SYSUT2    DD SYSOUT=(I,,INV5),RECFM=FBA,
//             OUTPUT=(*.OUT1,*.OUT2,*.OUT3),DEST=(LP1E1P25),COPIES=1
//SYSUT1    DD DSN=SHATTLA.INVOICE.SAMPLE,DISP=OLD
//SYSIN     DD DUMMY                                                    00050023
//SYSPRINT  DD SYSOUT=*                                                 00060023
//*
./       ADD   NAME=REBIND
//JONNALRB JOB (TEST,DEV),'** BIND JCL **',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR,USER=DEVDBA
//****************************************************************
//*   THIS JOB USES THE IKJEFT01 UTILITY TO RE-BIND A DB2        *
//*   PLAN (USUALLY TO PUT EXPLAIN=YES TO USE SQL ANALYZER).     *
//****************************************************************
//BIND      EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB   DD DSN=SYS2.DB2.DSNT.SDSNLOAD,DISP=SHR
//DBRMLIB   DD DSN=TEST.DB2.DBRMLIB,DISP=SHR
//          DD DSN=PROD.DB2.DBRMLIB,DISP=SHR
//SYSTSPRT  DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSDBOUT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//SYSTSIN   DD DSN=PROD.DB2.COMMANDS(#RUNDSNT),DISP=SHR
//          DD DSN=PROD.DB2.BIND(PATR750B),DISP=SHR
./       ADD   NAME=REPRO
//SAMBANP1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=SAMBANP
/*JOBPARM SYSAFF=TOYB
//***
//CLEANUP  EXEC  PGM=IEFBR14
//DEL001     DD    DSN=SVWA$DV.CAMPAIGN.MASTER.TEST,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//***
//REPR1  EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=SVWA$DV.F01.CAMPAIGN.MASTER.FILE,
//            DISP=SHR
//DD2      DD DSN=SVWA$DV.CAMPAIGN.MASTER.TEST,
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=TEST,
//             SPACE=(CYL,(05,02),RLSE),
//             DCB=(RECFM=FB,LRECL=0148,BLKSIZE=0)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2) FROMKEY('912') -
  TOKEY('912')
/*
//
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//REPR1  EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=SVWA.WAMM005.SERVICE.MASTER,
//            DISP=SHR
//DD2      DD DSN=SVWA$DV.WAMM005.SERVICE.MASTER,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2) FROMKEY('JTDAT123110195424') -
  TOKEY('JTDAT123110195424') REPLACE
/*
//*
./       ADD   NAME=SASCOPY
//SAMBANPS JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,          00000100
//             REGION=8M,NOTIFY=SAMBANP                                 00000200
//***
//CLEANUP  EXEC  PGM=IEFBR14
//DEL001     DD    DSN=SVWA$DV.CAMPAIGN.MASTER.TEST,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//***
//****************************************************************      00000300
//*   THIS JOB EXECUTES A SAS PROGRAM TO READ A VSAM FILE.       *      00000400
//*                                                              *      00000400
//*   - DEMONSTRATES SEQ. READ OF A VSAM FILE.                   *      00000400
//*                                                              *      00000400
//****************************************************************      00000300
//STEP01   EXEC SAS,WORK='60000,200',                                   00000700
//         OPTIONS='ERRORABEND,SOURCE,SOURCE2',                         00000800
//         CONFIG='PROD.BATCH.SAS(CONFIG)'                              00000900
//LIBRARY  DD DSN=TEST.BATCH.SASFMTS,DISP=SHR                           00001000
//         DD DSN=PROD.BATCH.SASFMTS,DISP=SHR                           00001100
//SOURCLIB DD DSN=PROD.BATCH.SAS,DISP=SHR                               00001200
//DEALER   DD DSN=SVWA$DV.F01.CAMPAIGN.MASTER.FILE,DISP=SHR             00001200
//FILEOUT  DD DSN=SVWA$DV.CAMPAIGN.MASTER.TEST,                         00001200
//         DISP=(NEW,CATLG,DELETE),
//         UNIT=TEST,
//         SPACE=(CYL,(05,02),RLSE),
//         DCB=(RECFM=FB,LRECL=0157,BLKSIZE=0)
//SYSIN    DD *                                                         00001500
 DATA TEST;                                                             00001600
    INFILE DEALER VSAM;                                                 00001700
    INPUT @01   CAMPNO   $CHAR3.                                        00001800
          @04   VIN      $CHAR17.                                       00001800
          @21   DEALER   $CHAR5.                                        00001800
          @26   OWNNAME  $CHAR30.                                       00001800
          @56   OWNADDR  $CHAR30.                                       00001800
          @86   OWNCITY  $CHAR30.                                       00001800
          @116  INVENTY  $CHAR1.                                        00001800
          @117  DLYDATE  $CHAR6.                                        00001800
          @123  DEPT     $CHAR2.                                        00001800
          @125  ZONE     $CHAR1.                                        00001800
          @126  LOC      $CHAR2.                                        00001800
          @128  EXTRDT   $CHAR6.                                        00001800
          @134  REGDT    $CHAR6.                                        00001800
          @140  SUSPRSN  $CHAR1.                                        00001800
          @141  SOURCE   $CHAR1.                                        00001800
          @142  STATUS   $CHAR1.                                        00001800
          @143  SERVDT   $CHAR6. ;                                      00001800
                                                                        00002400
     IF CAMPNO = '912'
     THEN OUTPUT ;
                                                                        00002400
DATA _NULL_;
   SET TEST;
    FILE FILEOUT;
    DELIM = ',';

    PUT @01   CAMPNO   $CHAR3.
        @04   DELIM    $CHAR1.
        @05   VIN      $CHAR17.
        @22   DELIM    $CHAR1.
        @23   DEALER   $CHAR5.
        @28   DELIM    $CHAR1.
        @29   OWNNAME  $CHAR30.
        @59   DELIM    $CHAR1.
        @60   OWNADDR  $CHAR30.
        @90   DELIM    $CHAR1.
        @91   OWNCITY  $CHAR30.
        @121  DELIM    $CHAR1.
        @122  INVENTY  $CHAR1.
        @123  DELIM    $CHAR1.
        @124  DLYDATE  $CHAR6.
        @130  DELIM    $CHAR1.
        @131  DEPT     $CHAR2.
        @133  DELIM    $CHAR1.
        @134  ZONE     $CHAR1.
        @135  DELIM    $CHAR1.
        @136  LOC      $CHAR2.
        @138  DELIM    $CHAR1.
        @139  EXTRDT   $CHAR6.
        @145  DELIM    $CHAR1.
        @146  REGDT    $CHAR6.
        @152  DELIM    $CHAR1.
        @153  SUSPRSN  $CHAR1.
        @154  DELIM    $CHAR1.
        @155  SOURCE   $CHAR1.
        @156  DELIM    $CHAR1.
        @157  STATUS   $CHAR1. ;

/*                                                                      00002400
//                                                                      00002500
./       ADD   NAME=SASVINHS
//JONNALRS JOB (TEST,DEV),'PREVIN HISTORY',
//         CLASS=E,NOTIFY=JONNALR,MSGCLASS=X
//****************************************************************
//*   THIS JOB READS THE PREVIN HISTORY FILE TO INQUIRE          *
//*   ABOUT A CERTAIN VEHICLE.                                   *
//****************************************************************
//STEPSAS  EXEC SAS,WORK='60000,200',COND=(7,LT),
//         OPTIONS='ERRORABEND,SOURCE,SOURCE2'
//*** COPY BOOK IS VBILMT01
//HISTFILE DD DSN=VHWR.PREVIN.HISTORY(0),
//            DISP=SHR
//SYSIN    DD *

 DATA VINDATA (KEEP=VIN ENGINE MODNAME MODYR WHSLDATE);
    INFILE HISTFILE;
    INPUT  @01   VIN       $CHAR17.
           @01   VINMDL    $CHAR5.
           @09   VINENG    $CHAR6.
           @37   ENGINE    $CHAR7.
           @38   ENGLAST   $CHAR6.
           @44   MODNAME   $CHAR30.
           @249  MODYR     $CHAR1.
           @1523 WHSLDATE  $CHAR8.;
    IF VINENG  = '064922'
       THEN OUTPUT;
    IF ENGLAST = '064922'
       THEN OUTPUT;

 PROC PRINT N UNIFORM SPLIT='*';
    ID VIN;
    VAR ENGINE MODNAME MODYR WHSLDATE;
    TITLE 'TOYOTA CANADA INC.';
    TITLE2 'LIST OF OLD VINS FOUND FOR ENGINE NUMBER ON PREVIN HISTORY';

./       ADD   NAME=SASVINHT
//JONNALRS JOB (TEST,DEV),'VIN HISTORY',
//         CLASS=E,NOTIFY=JONNALR,MSGCLASS=X
//****************************************************************
//*   THIS JOB READS THE VIN HISTORY FILE TO INQUIRE             *
//*   ABOUT A CERTAIN VEHICLE.                                   *
//****************************************************************
//STEPSAS  EXEC SAS,WORK='60000,200',COND=(7,LT),
//         OPTIONS='ERRORABEND,SOURCE,SOURCE2'
//*** COPY BOOK IS VBILMT01
//HISTFILE DD DSN=VHWR.VIN.HISTORY(0),DISP=SHR
//*HISTFILE DD DSN=VHWR.PREVIN.HISTORY(0),DISP=SHR
//SYSIN    DD *

 DATA VINDATA (KEEP=VIN REGDATE MODNAME);
    INFILE HISTFILE;
    INPUT  @01   VIN       $CHAR17.
           @12   SERIAL    $CHAR6.
           @37   ENGINE    $CHAR7.
           @38   ENGLAST   $CHAR6.
           @44   MODNAME   $CHAR30.
           @74   DEALER    $CHAR5.
           @103  REGDATE   $CHAR6.
           @249  MODYR     $CHAR1.
           @1523 WHSLDATE  $CHAR8.;
    IF DEALER  = '53009'
       THEN OUTPUT;

 PROC PRINT N UNIFORM SPLIT='*';
    VAR VIN REGDATE MODNAME ;
    TITLE 'TOYOTA CANADA INC.';
    TITLE2 'LIST OF OLD VINS FOUND FOR #53009 ON VIN HISTORY';

./       ADD   NAME=SEARCH
//JONNALR2 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//JOBLIB    DD DSN=TEST.BATCH.LOAD,DISP=SHR
//          DD DSN=PROD.BATCH.LOAD,DISP=SHR
//****************************************************************
//*   THIS JOB USES THE ISRSUPC UTILITY TO SEARCH FOR MEMBERS    *
//*   IN PDS LIBRARIES THAT CONTAIN A CERTAIN KEYWORD.           *
//****************************************************************
//STEP01   EXEC PGM=ISRSUPC,PARM=(SRCHCMP,'ANYC')
//NEWDD    DD DSN=PROD.BATCH.COBOL,
//            DISP=SHR
//         DD DSN=PROD.BATCH.COPY,
//            DISP=SHR
//         DD DSN=PROD.CICS.COBOL,
//            DISP=SHR
//OUTDD    DD SYSOUT=*
//SYSIN    DD *
SRCHFOR '8952E'
SRCHFOR 'AET_NVR_CTGRY_CD'
/*
//*
./       ADD   NAME=SENDMAIL
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//JOBLIB    DD DSN=TEST.BATCH.LOAD,DISP=SHR
//          DD DSN=PROD.BATCH.LOAD,DISP=SHR
//JCLPROC   JCLLIB ORDER=DEVT.LAWSON.PROCLIB
//STEP120 EXEC XMITIP
//SYSIN     DD DSN=JONNALR.TEST.PARM(SENDMAIL),DISP=SHR
./       ADD   NAME=SORTHIST
//JONNALRS JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//*-------------------------------------------------------------------*
//*- TCV701 GET ALL THE VINS FROM 1998 TO 2007
//*-------------------------------------------------------------------*
//STEP020 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTWK01 DD SPACE=(CYL,(100)),UNIT=TEST
//SORTWK02 DD SPACE=(CYL,(300)),UNIT=TEST
//SORTWK03 DD SPACE=(CYL,(300)),UNIT=TEST
//SORTWK04 DD SPACE=(CYL,(300)),UNIT=TEST
//SORTIN    DD DSN=VHWR.VIN.HISTORY(0),DISP=SHR
//          DD DSN=VHWR.PREVIN.HISTORY(0),DISP=SHR
//SORTOUT   DD DSN=VHWR$DV.VIN1,DISP=SHR
//SYSIN     DD *
 SORT FIELDS=(1,17,CH,A)
 SUM FIELDS=NONE
 INCLUDE COND=(1258,05,CH,EQ,C'53009')
 OUTFIL OUTREC=(1:1,17,20:103,6,80:X'40')
//*
//
//
./       ADD   NAME=SORTLOAN
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//JOBLIB    DD DSN=TEST.BATCH.LOAD,DISP=SHR
//          DD DSN=PROD.BATCH.LOAD,DISP=SHR
//JCLPROC   JCLLIB ORDER=DEVT.LAWSON.PROCLIB
//***
//CLEANUP  EXEC  PGM=IEFBR14
//DEL001     DD    DSN=VHKI$DV.LEASE.PAYOUT.INPUT.FMT,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//***
//**********************************************************************
//* REFORMAT TFS LOAN FILE
//**********************************************************************
//STEP010 EXEC PGM=SORT,
//             REGION=2048K,
//             COND=(0,NE)
//SYSOUT    DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHKI$DV.LEASE.PAYOUT.INPUT,
//             DISP=SHR
//SORTOUT   DD DSN=VHKI$DV.LEASE.PAYOUT.INPUT.FMT,
//             UNIT=TEST,
//             SPACE=(CYL,(20,10),RLSE),
//             DCB=(LRECL=600,BLKSIZE=0,RECFM=FB),
//             DISP=(NEW,CATLG,DELETE)
//SYSIN     DD DSN=JONNALR.TEST.PARM(VHKITEST),DISP=SHR
//*
./       ADD   NAME=SORTPROQ
//JONNALRS JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//*-------------------------------------------------------------------*
//*- DATA SENT TO PROQUEST
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=ICETOOL,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//TOOLMSG   DD SYSOUT=*
//DFSMSG    DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//IN        DD DSN=VHOM$DV.PROQUEST.VINS.D060620,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D060716,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D060816,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D060916,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D061016,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D061116,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D061216,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070116,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070216,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070316,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070319,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070323,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070416,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070516,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D070616,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D1998,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D1999,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2000,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2001,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2002,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2003,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2004,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2005,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2006,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.VINS.D2007,DISP=SHR
//OUT       DD DSN=VHOM$DV.PROQUEST.VINS.SENT,DISP=SHR
//DUPL      DD SYSOUT=*
//TOOLIN    DD *
 SELECT FROM(IN) TO(OUT) ON(1,17,CH) LAST
/*
//*
//*-------------------------------------------------------------------*
//*- TCV701 GET ALL THE VINS FROM 1998 TO 2007
//*-------------------------------------------------------------------*
//STEP020 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTWK01 DD SPACE=(CYL,(100)),UNIT=TEST
//SORTWK02 DD SPACE=(CYL,(300)),UNIT=TEST
//SORTWK03 DD SPACE=(CYL,(300)),UNIT=TEST
//SORTWK04 DD SPACE=(CYL,(300)),UNIT=TEST
//SORTIN    DD DSN=VHOM$DV.PROQUEST.TCV701.D00,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D01,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D02,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D03,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D04,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D05,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D06,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D07,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D98,DISP=SHR
//          DD DSN=VHOM$DV.PROQUEST.TCV701.D99,DISP=SHR
//SORTOUT   DD DSN=VHOM$DV.PROQUEST.TCV701.SRT,DISP=SHR
//SYSIN     DD *
 SORT FIELDS=(1,17,CH,A,26,10,CH,A)
//*
//*-------------------------------------------------------------------*
//*- TCV701 GET RID OF DUPLICATES
//*-------------------------------------------------------------------*
//STEP030 EXEC PGM=ICETOOL,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//TOOLMSG   DD SYSOUT=*
//DFSMSG    DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//IN        DD DSN=VHOM$DV.PROQUEST.TCV701.SRT,DISP=SHR
//OUT       DD DSN=VHOM$DV.PROQUEST.TCV701.SRT1,DISP=SHR
//DUPL      DD SYSOUT=*
//TOOLIN    DD *
 SELECT FROM(IN) TO(OUT) ON(1,17,CH) LAST
/*
//*
//****************************************************************
//*   DEFINE PROQUEST VSAM FILE                                  *
//****************************************************************
//STEP40    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING PROQUEST FILE                            */
 /*                                                              */
    DELETE (VHOM$DV.PROQUEST.MASTER)   -
           PURGE                         -
           CLUSTER
 /*                                                              */
 /* DEFINE THE PROQUEST FILE                                     */
   DEFINE  CLUSTER (NAME (VHOM$DV.PROQUEST.MASTER)    -
                    TRACKS (200 10)               -
                    FREESPACE (0 0)               -
                    INDEXED                       -
                    KEYS (17 0)                   -
                    RECORDSIZE (135 135)          -
                    SHAREOPTIONS (2)              -
                    SPEED                         -
                                      )
/*
//****************************************************************
//*   REPRO  PROQUEST VSAM FILE FROM PRODUCTION                  *
//****************************************************************
//STEP50 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=VHOM$DV.PROQUEST.VINS.SENT,
//            DISP=SHR
//DD2      DD DSN=VHOM$DV.PROQUEST.MASTER,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//*
//*
//****************************************************************
//*   DEFINE TCV701   VSAM FILE                                  *
//****************************************************************
//STEP60    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING PROQUEST FILE                            */
 /*                                                              */
    DELETE (VHOM$DV.PROQUEST.TCV701)   -
           PURGE                         -
           CLUSTER
 /*                                                              */
 /* DEFINE THE PROQUEST FILE                                     */
   DEFINE  CLUSTER (NAME (VHOM$DV.PROQUEST.TCV701)    -
                    TRACKS (200 10)               -
                    FREESPACE (0 0)               -
                    INDEXED                       -
                    KEYS (17 0)                   -
                    RECORDSIZE (212 212)          -
                    SHAREOPTIONS (2)              -
                    SPEED                         -
                                      )
/*
//****************************************************************
//*   REPRO  PROQUEST VSAM FILE FROM PRODUCTION                  *
//****************************************************************
//STEP70 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=VHOM$DV.PROQUEST.TCV701.SRT1,
//            DISP=SHR
//DD2      DD DSN=VHOM$DV.PROQUEST.TCV701,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//*
//
./       ADD   NAME=SPLTREC
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
//STEP0100 EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD *
RAMA MOHA STEVE MINCHO
RAMA MOH1 STEVE MINCH1
//SORTOUT  DD SYSOUT=*
//SYSIN    DD *
  SORT FIELDS=COPY
  OUTFIL OUTREC=(01,10,/,
                 11,10)
/*
./       ADD   NAME=SQLISRT
   INSERT
     INTO  DVHDIST.TD9_USER_ACCESS
          (D9_USER_ID
          ,D9_PROGRAM
          ,D9_AUTH_ADD
          ,D9_AUTH_UPDATE
          ,D9_AUTH_DELETE
          ,D9_SUB_SYSTEM_ID
          ,D9_LST_UPD_USERID
          ,D9_LST_UPD_PGM_ID
          ,D9_TIMESTAMP
          )
   VALUES ('JONNALR'
          ,'VHAC050P'
          ,'Y'
          ,'Y'
          ,'Y'
          ,'PLAN'
          ,'TOYDBA'
          ,'SPUFI'
          ,CURRENT TIMESTAMP);
--
./       ADD   NAME=SRCH
//JONNALR9 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//SEARCH  EXEC PGM=ISRSUPC,                                           *
//            PARM=(SRCHCMP,
//            'ANYC')
//NEWDD  DD DSN=PROD.BATCH.COBOL,DISP=SHR
//OUTDD  DD SYSOUT=*
//SYSIN  DD *
SRCHFOR  'ACLA525W'
/*
./       ADD   NAME=STARTDB
//JONNALRU  JOB (TEST,DEV),'DB2 START UTILITY',CLASS=A,
//          USER=DEVDBA,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   THIS JOB USES THE IKJEFT01 UTILITY TO START A DB2          *
//*   DATABASE TO FORCE IT OUT OF COPY PENDING STATUS.           *
//****************************************************************
//STEP010  EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
  DSN SYSTEM(DSNT)
     -STOP DATABASE(DTCCORP) SPACENAM(SVHFMAFY)
     -START DATABASE(DTCCORP) SPACENAM(SVHFMAFY) ACCESS(FORCE)
  END
//*
./       ADD   NAME=SUFXAPX
//JONNALRI  JOB (TEST,DEV),'IDCAMS STUFF',CLASS=A,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   DEFINE SUFFIX VSAM FILE                                    *
//****************************************************************
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING SUFFIX FILE                              */
 /*                                                              */
   DELETE  (VHDI$DV.SUFFIX.PRIMARY) -
           PURGE                  -
           CLUSTER
 /*                                                              */
 /* DEFINE THE SUFFIX FILE                                       */
   DEFINE  CLUSTER (NAME (VHDI$DV.SUFFIX.PRIMARY)   -
                    TRACKS (180 18)                 -
                    FREESPACE (10 10)               -
                    INDEXED                         -
                    KEYS (11 0)                     -
                    RECORDSIZE (300 300)            -
                    SHAREOPTIONS (2)                -
                    SPEED                           -
                                      )
/*
//****************************************************************
//*   REPRO  SUFFIX VSAM FILE FROM PRODUCTION                    *
//****************************************************************
//STEP02 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=VHDI.SUFFIX.PRIMARY,
//            DISP=SHR
//DD2      DD DSN=VHDI$DV.SUFFIX.PRIMARY,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//****************************************************************
//*   DEFINE APX VSAM FILE                                       *
//****************************************************************
//STEP03    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING APX MASTER FILE                          */
 /*                                                              */
   DELETE  (VHDI$DV.DIS.F04.APX.MASTER) -
           PURGE                      -
           CLUSTER
 /*                                                              */
 /* DEFINE THE APX FILE                                          */
   DEFINE  CLUSTER (NAME (VHDI$DV.DIS.F04.APX.MASTER)   -
                    TRACKS (30 3)                       -
                    FREESPACE (0 0)                     -
                    INDEXED                             -
                    KEYS (17 0)                         -
                    OWNER (SALES)                       -
                    RECORDSIZE (165 165)                -
                    SHAREOPTIONS (2)                    -
                    SPEED                               -
                                    )
/*
//****************************************************************
//*   REPRO APX VSAM FILE FROM PRODUCTION                        *
//****************************************************************
//STEP04 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=VHDI.DIS.F04.APX.MASTER,
//            DISP=SHR
//DD2      DD DSN=VHDI$DV.DIS.F04.APX.MASTER,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//*
//****************************************************************
//*   DEFINE COLOR  VSAM FILE                                    *
//****************************************************************
//STEP05    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING COLOUR MASTER FILE                       */
 /*                                                              */
   DELETE  (VHDI$DV.COLOUR.PRIMARY) -
           PURGE                  -
           CLUSTER
 /*                                                              */
 /* DEFINE THE COLOUR FILE                                       */
   DEFINE  CLUSTER (NAME (VHDI$DV.COLOUR.PRIMARY)   -
                    TRACKS (2 1)                    -
                    FREESPACE (0 0)                 -
                    INDEXED                         -
                    KEYS (8 0)                      -
                    RECORDSIZE (100 100)            -
                    SHAREOPTIONS (2)                -
                    SPEED                           -
                                      )             -
           DATA (NAME (VHDI$DV.COLOUR.PRIMARY.DATA)) -
           INDEX (NAME (VHDI$DV.COLOUR.PRIMARY.INDEX))
/*
//****************************************************************
//*   REPRO COLOUR VSAM FILE FROM PRODUCTION                     *
//****************************************************************
//STEP06 EXEC PGM=IDCAMS,REGION=1024K
//DD1      DD DSN=VHDI.COLOUR.PRIMARY,
//            DISP=SHR
//DD2      DD DSN=VHDI$DV.COLOUR.PRIMARY,
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(DD1)  OUTFILE(DD2)
/*
//*
//STEP07    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 /* DELETE THE EXISTING COLOUR MASTER FILE                       */
 /*                                                              */
   DELETE  (VHDI$DV.COLOUR.ALTERNAT) -
           PURGE                   -
           AIX
 /*                                                              */
 /* DEFINE THE COLOUR FILE                                       */
   DEFINE  AIX (NAME (VHDI$DV.COLOUR.ALTERNAT)       -
                TRACKS (11 0)                        -
                IMBED                                -
                KEYS (6 19)                          -
                NONUNIQUEKEY                         -
                RELATE (VHDI$DV.COLOUR.PRIMARY)      -
                SPEED                                -
                SHAREOPTIONS (4)                     -
                UPGRADE                              -
                FREESPACE (0 0)                      -
                                  )                  -
           DATA  (NAME (VHDI$DV.COLOUR.ALTERNAT.DATA) -
                CISZ (512)                           -
                 )                                   -
           INDEX (NAME (VHDI$DV.COLOUR.ALTERNAT.INDEX) -
                CISZ (512) )
   DEFINE  PATH  (NAME (VHDI$DV.COLOUR.PATH)        -
                  FILE (COLPTH)                     -
                  PATHENTRY (VHDI$DV.COLOUR.ALTERNAT) -
                  UPDATE  )
   BLDINDEX  INDATASET  (VHDI$DV.COLOUR.PRIMARY) -
             OUTDATASET (VHDI$DV.COLOUR.ALTERNAT)
//****************************************************************
//
./       ADD   NAME=TCITIARW
000100******************************************************************00010000
000200*     TCITIARW       CALL DSNTIAR TO TRANSLATE SQLCODE           *00020000
000300*                    - WORKING STORAGE                           *00030000
000400*                                                                *00040000
000500*           USED BY: TCITIARB,TCITIARP                           *00050000
000600*        CREATED ON: MAY 08/90                                   *00060000
000700*  LAST MODIFIED ON: MAY 08/90                                   *00070000
000800*                BY: JJ HOMPPI                                   *00080000
000900******************************************************************00090000
001000 01  TCITIARW-COMMAREA.                                           00100000
001100*      IF THE LENGTH OF THIS COPYBOOK CHANGES ENSURE THAT THE     00110000
001200*      DFHCOMMAREA IN LINKAGE OF TCITIARP IS ALSO CHANGED AND THAT00120000
001210*      THE COMMAREA IN LINKAGE OF TCITIARB IS ALSO CHANGED.       00121000
001220   05  TCITIARW-COMMAREA-LENGTH            PIC S9(04) COMP        00122000
001230                                           VALUE +1104.           00123000
001240   05  TCITIARW-SQLCA                      PIC X(136).            00124000
001250   05  TCITIARW-DB2-ERROR-MESSAGE.                                00125000
001260     10  TCITIARW-DB2-ERROR-LEN            PIC S9(04) COMP        00126000
001270                                           VALUE +960.            00127000
001280     10  TCITIARW-DB2-ERROR-TEXT OCCURS 8  PIC X(120).            00128000
001290   05  TCITIARW-DB2-ERROR-TEXT-LEN         PIC S9(09) COMP        00129000
001300                                           VALUE +120.            00130000
001400* END TCITIARW                                                    00140000
./       ADD   NAME=TERMUTIL
//JONNALRU  JOB (TEST,DEV),'DB2 TERM UTILITY',CLASS=F,
//          USER=DEVDBA,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//****************************************************************
//*   THIS JOB USES THE IKJEFT01 UTILITY TO TERMINATE A          *
//*   SPECIFIC DB2 UTILITY ID.                                   *
//****************************************************************
//STEP010  EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
  DSN SYSTEM(DSNT)
     -START DATABASE(DBMDFIN) SPACENAM(XBMB300) ACCESS(FORCE)
     -START DATABASE(DBMDFIN) SPACENAM(XBMB301) ACCESS(FORCE)
  END
/*
//*
./       ADD   NAME=TEST
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//JOBLIB    DD DSN=TEST.BATCH.LOAD,DISP=SHR
//          DD DSN=PROD.BATCH.LOAD,DISP=SHR
//JCLPROC   JCLLIB ORDER=DEVT.LAWSON.PROCLIB
//*********************************************************************
//* CREATE A SEPARATE FILE FOR HSBC                                   *
//*********************************************************************
//STEP011 EXEC PGM=SORT,         **  NVEH0656  **
//             REGION=1024K,
//             COND=(0,NE)
//*********************************************************************
//SYSOUT    DD SYSOUT=*
//SYSIN     DD DISP=SHR,DSN=DEVT.LAWSON.PARMLIB(VHDI1609)
//SORTIN    DD DSN=VHDI.SD.GE.A3000.INVOICE.A656.A660.A670.A685,
//             DISP=SHR
//SORTOUT   DD DSN=VHDI$DV.SD.GE.A3000.HSBC,
//             UNIT=TEST,
//             SPACE=(TRK,(00050,00005),RLSE),
//             DCB=(RECFM=FB,LRECL=01410,BLKSIZE=0),
//             DISP=(NEW,CATLG,DELETE)
//
//*********************************************************************
//* CREATE A SEPARATE FILE FOR GMAC                                   *
//*********************************************************************
//STEP012 EXEC PGM=SORT,         **  NVEH0656  **
//             REGION=1024K,
//             COND=(0,NE)
//*********************************************************************
//SYSOUT    DD SYSOUT=*
//SYSIN     DD DISP=SHR,DSN=DEVT.LAWSON.PARMLIB(VHDI1608)
//SORTIN    DD DSN=VHDI.SD.GE.A3000.INVOICE.A656.A660.A670.A685,
//             DISP=SHR
//SORTOUT   DD DSN=VHDI$DV.SD.GE.A3000.GMAC,
//             UNIT=TEST,
//             SPACE=(TRK,(00050,00005),RLSE),
//             DCB=(RECFM=FB,LRECL=01410,BLKSIZE=0),
//             DISP=(NEW,CATLG,DELETE)
./       ADD   NAME=TESTJOBS
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//JOBLIB    DD DSN=TEST.BATCH.LOAD,DISP=SHR
//          DD DSN=PROD.BATCH.LOAD,DISP=SHR
//*
//*********************************************************************
//*                                                                  *
//*        SORT THE JAPAN VESSEL ARRIVAL DATA                        *
//*             BY : VOYAGE NO.                                      *
//*                                                                  *
//************************************************* STEP020 **********
//STEP020 EXEC PGM=SORT,REGION=1024K
//************************************************* STEP020 **********
//SORTLIB   DD DSN=SYS1.SORTLIB,DISP=SHR
//SORTIN    DD DSN=VHDI.FRASER.WHARVES.DIS185B.DISKPUN,DISP=SHR
//SORTOUT   DD DSN=&&DISF20,
//             DISP=(NEW,PASS,DELETE),
//             SPACE=(TRK,(50,10),RLSE),
//             UNIT=TEST,
//             DCB=(RECFM=FB,LRECL=160,BLKSIZE=0)
//SYSOUT    DD SYSOUT=*
//SYSIN     DD DSN=PROD.BATCH.PARMLIB(VHCU0011),DISP=SHR
//*
//************************************************* STEP030 **********
//*                                                                  *
//*        VHCU001B - JAPAN VEHICLE DATA EXTRACT                     *
//*                                                                  *
//************************************************* STEP030 **********
//STEP030 EXEC PGM=IKJEFT1A,DYNAMNBR=20
//************************************************* STEP030 **********
//SYSTSPRT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//SYSDBOUT  DD SYSOUT=*
//SYSABOUT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//********  DATE PARAMETER FILE
//DATEDD    DD DSN=PROD.BATCH.DATE(VEHDATE),DISP=SHR
//********  JAPAN VESSEL ARRIVAL DATA
//DISF20I   DD DSN=&&DISF20,DISP=(OLD,DELETE,DELETE)
//MODELI    DD DSN=VHDI.MODEL.MASTER,DISP=SHR
//SUFFIXI   DD DSN=VHDI.SUFFIX.PRIMARY,DISP=SHR
//OPTIONI   DD DSN=VHDI.OPTION.MASTER,DISP=SHR
//DISF14I   DD DSN=VHDI.DIS.F14.VESSEL.CONTROL.FILE,DISP=SHR
//********  RAF INVOICE DATA - OUTPUT
//VHCU001O  DD DSN=VHDI$DV.VHCU001F.VHCU001D.INTRM001,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(50,10),RLSE),
//             UNIT=TEST,
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)
//********  CONTROL REPORT
//PACC998O  DD SYSOUT=*
//*
//SYSTSIN   DD DSN=PROD.DB2.COMMANDS(#RUNTEST),DISP=SHR
//          DD DSN=PROD.DB2.COMMANDS(VHCU001B),DISP=SHR
//
//*********************************************************************
//*                                                                   *
//*  DETERMINE THE COST OF THE BOUGHT OFF VEHICLES                    *
//*     CREATE THE RECEIVING RESULTLS FILE AND THE AP FILES           *
//*                                                                   *
//*********************************************************************
//STEP110 EXEC PGM=IKJEFT1A,
//             DYNAMNBR=20,
//             COND=(0,NE)
//************************************************ 010 ****************
//SYSTSIN   DD DSN=PROD.DB2.COMMANDS(#RUNTEST),DISP=SHR
//          DD DSN=PROD.DB2.COMMANDS(VHAC039B),DISP=SHR
//*********************************************************************
//SYSOUT    DD SYSOUT=*
//SYSTSPRT  DD SYSOUT=*
//SYSDBOUT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//VHAC001   DD DSN=VHSA.VEHICLE.BUYOFF,
//             DISP=OLD
//VHSA010A  DD DSN=VHSA$DV.TMMC.RECEIVE.RESULT,
//             UNIT=TEST,
//             SPACE=(TRK,(15,1),RLSE),
//             LRECL=160,BLKSIZE=0,RECFM=FB,
//             DISP=(NEW,CATLG,DELETE)
//VHSA010B  DD DSN=VHSA$DV.TMM.RECEIVE.RESULT.REPORT.FILE,
//             UNIT=TEST,
//             SPACE=(TRK,(15,1),RLSE),
//             LRECL=160,BLKSIZE=0,RECFM=FB,
//             DISP=(NEW,CATLG,DELETE)
//VHSA010C  DD DSN=VHSA$DV.NUMMI.RECEIVE.RESULT.REPORT.FILE,
//             UNIT=TEST,
//             SPACE=(TRK,(15,1),RLSE),
//             LRECL=160,BLKSIZE=0,RECFM=FB,
//             DISP=(NEW,CATLG,DELETE)
//VHSA010D  DD DSN=VHSA$DV.TMMI.RECEIVE.RESULT.REPORT.FILE,
//             UNIT=TEST,
//             SPACE=(TRK,(15,1),RLSE),
//             LRECL=160,BLKSIZE=0,RECFM=FB,
//             DISP=(NEW,CATLG,DELETE)
//VHSA010E  DD DSN=VHSA$DV.TMMTX.RECEIVE.RESULT.REPORT.FILE,
//             UNIT=TEST,
//             SPACE=(TRK,(15,1),RLSE),
//             LRECL=160,BLKSIZE=0,RECFM=FB,
//             DISP=(NEW,CATLG,DELETE)
//VHSA009   DD DSN=VHSA$DV.TMM.RECEIVE.RESULT,
//             UNIT=TEST,
//             SPACE=(TRK,(15,1),RLSE),
//             LRECL=160,BLKSIZE=0,RECFM=FB,
//             DISP=(NEW,CATLG,DELETE)
//VHSA009A  DD DSN=VHSA$DV.NUMMI.RECEIVE.RESULT,
//             UNIT=TEST,
//             SPACE=(TRK,(15,1),RLSE),
//             LRECL=160,BLKSIZE=0,RECFM=FB,
//             DISP=(NEW,CATLG,DELETE)
//VHSA009B  DD DSN=VHSA$DV.TMMI.RECEIVE.RESULT,
//             UNIT=TEST,
//             SPACE=(TRK,(15,1),RLSE),
//             LRECL=160,BLKSIZE=0,RECFM=FB,
//             DISP=(NEW,CATLG,DELETE)
//VHSA009C  DD DSN=VHSA$DV.TMMTX.RECEIVE.RESULT,
//             UNIT=TEST,
//             SPACE=(TRK,(15,1),RLSE),
//             LRECL=160,BLKSIZE=0,RECFM=FB,
//             DISP=(NEW,CATLG,DELETE)
//VHAC004   DD DSN=VHSA$DV.VEHICLES.AP.VHAC039B.FILE,
//             UNIT=TEST,
//             SPACE=(TRK,(15,1),RLSE),
//             LRECL=300,BLKSIZE=0,RECFM=FB,
//             DISP=(NEW,CATLG,DELETE)
//VHMS001   DD DSN=VHMS.F01.PLANT.HOLIDAYS.FILE,DISP=SHR
//MODEL     DD DSN=VHDI.MODEL.MASTER,DISP=SHR
//OPTION    DD DSN=VHDI.OPTION.MASTER,DISP=SHR
//**
//VHACVALU  DD DUMMY
//*VHACVALU  DD DSN=VHSA$DV.BUYOFF.VALUE.FILE,
//*             UNIT=TEST,
//*             SPACE=(TRK,(25,1),RLSE),
//*             LRECL=39,BLKSIZE=0,RECFM=FB,
//*             DISP=(NEW,CATLG,DELETE)
//DATEDD    DD DSN=PROD.BATCH.DATE(VHSADATE),DISP=SHR
//*
//
//*********************************************************************
//***                                                               ***
//***          READ MONTHLY SORTED BILLING FILE AND CREATE THE      ***
//***          MONTHLY ADJUSTMENT VEHICLE SALES REPORT              ***
//***                                                               ***
//*********************************************************************
//***       ***  COMBINED SALES SUMMARY  ***                        ***
//***          READ DEALER MASTER VSAM FILE                         ***
//***          READ MODEL MASTER VSAM FILE                          ***
//***          READ OPTION MASTER VSAM FILE                         ***
//***          UPDATES YTD BILLING FILE                             ***
//***          CREATE OPTION FILE FOR SUMMARY NVEH2435              ***
//*********************************************************************
//STEP120 EXEC PGM=IKJEFT1A,
//             REGION=1024K,
//             COND=(0,NE)
//*********************************************************************
//SYSTSIN   DD DSN=PROD.DB2.COMMANDS(#RUNTEST),DISP=SHR
//          DD DSN=PROD.DB2.COMMANDS(NVEH2430),DISP=SHR
//          DD DSN=PROD.BATCH.PARMLIB(VHBI0610),DISP=SHR
//SYSOUT    DD SYSOUT=*
//SYSTSPRT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//DISF01    DD DSN=VHDI.DIS.F01.SERIES.MASTER,
//             DISP=SHR
//SYS010    DD DSN=VHBI.BILLING.A8110.CBU,
//             DISP=OLD
//SYS011    DD DSN=VHBI$DV.YTD.BILLING.NVEH2430,
//             DISP=OLD
//SYS012    DD DSN=VHDI$DV.TEMP.YTD.BILLING.NVEH2430,
//             UNIT=WORK,
//             SPACE=(TRK,(00050,00025),RLSE),
//             DCB=(RECFM=FB,LRECL=160,BLKSIZE=0),
//             DISP=(NEW,DELETE,DELETE)
//SYS013    DD DUMMY,
//             DCB=(RECFM=FB,LRECL=040,BLKSIZE=0)
//OPTION    DD DSN=VHDI.OPTION.MASTER,
//             DISP=SHR
//DEALER    DD DSN=TCIP.DEALER.PRIMARY,
//             DISP=SHR
//LXDEALR   DD DSN=TCIP.LXDEALR.PRIMARY.FILE,
//             DISP=SHR
//MODEL     DD DSN=VHDI.MODEL.MASTER,
//             DISP=SHR
//SYS006    DD SYSOUT=*
//SYS007    DD SYSOUT=*
//DATEDD    DD DSN=PROD.BATCH.DATE(MTHDATE),DISP=SHR
./       ADD   NAME=TESTSORT
//JONNALRS JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//*
//***
//CLEANUP  EXEC  PGM=IEFBR14
//DEL001     DD    DSN=VHDI$DV.VHEC001D.TXLOG.EXTRACT.SEP30,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//***
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI.VHEC001D.TXLOG.ACCUM.G2641V00,DISP=SHR
//SORTOUT   DD DSN=VHDI$DV.VHEC001D.TXLOG.EXTRACT.SEP30,
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=TEST,
//             SPACE=(CYL,(05,02),RLSE),
//             DCB=(RECFM=FB,LRECL=1808,BLKSIZE=0)
//SYSIN     DD *
 SORT FIELDS=COPY
 INCLUDE COND=(53,10,CH,EQ,C'2008-09-30')
//*
//
//STEP020 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI.VHEC001D.MQMSG.ACCUM,DISP=SHR
//SORTOUT   DD SYSOUT=*
//SYSIN     DD *
 SORT FIELDS=COPY
 INCLUDE COND=(18,02,CH,EQ,C'09',AND,28,6,CH,EQ,C'JT923P',OR,
               18,02,CH,EQ,C'10',OR,
               18,02,CH,EQ,C'30',OR,
               18,02,CH,EQ,C'31')
//
//*-------------------------------------------------------------------*
//*-- COUNT THE NO. OF RECORDS IN THE INPUT FILE ---------------------*
//*-------------------------------------------------------------------*
//CTRCDS EXEC PGM=SORT
//SYSOUT DD SYSOUT=
//SORTIN DD DSN=JONNALR.INPUT,DISP=SHR
//SORTOUT DD DSN=JONNALR.OUTPUT,DISP=SHR
//SYSIN DD *
  OPTION COPY
  OUTFIL NODETAIL,REMOVECC,
  TRAILER1=(COUNT=(M11,LENGTH=8))
//
//*-------------------------------------------------------------------*
//*-- SQUEEZE MULTIPLE SPACES TO ONE SPACE       ---------------------*
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=JONNALR.INPUT,DISP=SHR
//SORTOUT   DD DSN=JONNALR.OUTPUT,DISP=SHR
//SYSIN     DD *
 OPTION COPY
 INREC BUILD=(1,48,SQZ=(SHIFT=LEFT,MID=C' '))
//
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=JONNALR.INPUT,DISP=SHR
//SORTOUT   DD SYSOUT=*
//SYSIN     DD *
 SORT FIELDS=COPY,
 OUTREC FIELDS=(1,10)
//
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=DSSI.DSSI100R.SIDATA.BKUP(-5),DISP=SHR
//SORTOUT   DD DSN=DSSI$DV.DSSI100R.SIDATA.BKUP.TEST,DISP=SHR
//SYSIN     DD *
 SORT FIELDS=(17,6,CH,A,25,2,CH,A)
 INCLUDE COND=(19,05,CH,EQ,C'85006',AND,49,2,CH,EQ,C'10')
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=DSSI.DSSI100R.SIDATA.BKUP(+0),DISP=SHR
//SORTOUT   DD DSN=DSSI$DV.DSSI100R.SIDATA.BKUP.TST1,DISP=SHR
//SYSIN     DD *
 SORT FIELDS=COPY
 INCLUDE COND=(19,05,CH,EQ,C'85006',AND,49,2,CH,EQ,C'10')
//
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=DCDT.DCVH01.BKUP(0),DISP=SHR
//SORTOUT   DD DSN=DCDT$DV.DCVH01.BKUP.#75040,DISP=SHR
//SYSIN     DD *
 SORT FIELDS=COPY
 INCLUDE COND=(5,04,CH,EQ,C'T601',AND,21,5,CH,EQ,C'75040')
//
//*-------------------------------------------------------------------*
//*- CREATE A SIMPLE REPORT
//*- MDY-
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=VHDI.VHEC001D.TXLOG.ACCUM.G2105V00,DISP=SHR
//SORTOUT   DD DSN=VHDI$DV.VHEC001D.TXLOG.DV541T,DISP=SHR
//SYSIN     DD *
 SORT FIELDS=COPY
 INCLUDE COND=(11,11,CH,EQ,C'DV541T B0202F')
//
//*-------------------------------------------------------------------*
//*- CREATE A SIMPLE REPORT
//*- MDY-
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=JONNALR.OUTPUT1,DISP=SHR
//          DD DSN=JONNALR.OUTPUT2,DISP=SHR
//          DD DSN=JONNALR.OUTPUT3,DISP=SHR
//          DD DSN=JONNALR.OUTPUT4,DISP=SHR
//          DD DSN=JONNALR.OUTPUT5,DISP=SHR
//          DD DSN=JONNALR.OUTPUT6,DISP=SHR
//          DD DSN=JONNALR.OUTPUT7,DISP=SHR
//          DD DSN=JONNALR.OUTPUT8,DISP=SHR
//SORTOUT   DD DSN=JONNALR.OUTPUT.FILE,DISP=SHR
//SYSIN     DD *
 SORT FIELDS=(17,6,CH,A,25,2,CH,A)
 INCLUDE COND=(2,3,CH,EQ,C'FOB')
 SUM FIELDS=NONE
 OUTREC FIELDS=(16,115)
//
//*-------------------------------------------------------------------*
//*- CREATE A SIMPLE REPORT
//*- MDY-
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD DSN=ACLA$DV.ACLA500B.ARDETAIL.AFT,DISP=SHR
//SORTOUT   DD DSN=ACLA$DV.ACLA500B.ARDETAIL.AFT1,DISP=SHR
//SYSIN     DD *
 SORT FIELDS=COPY
 OUTREC FIELDS=(1,200)
//
//*-------------------------------------------------------------------*
//*- CREATE A SIMPLE REPORT
//*- MDY-
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD *
1234567890123456789012345678901234567890123456789012345678901234567890
       ZONE001ACCT00000000001SEQNUM0012006-01-01                    
/*
//SORTOUT   DD SYSOUT=*
//SYSIN     DD *
 INREC   FIELDS=(1,7,8,7,15,15,30,9,39,10,49,5,54,5,59,5,64,5)
 SORT    FIELDS=(8,7,CH,A,15,15,CH,A)
 OUTFIL  OUTREC=(8,7,5X,
                 15,15,6X,
                 30,9,5X,
                 39,10,6X,
                 64,5,PD,EDIT=(III,IIT.TTS),SIGNS=(,,,-),5X),
         HEADER2=(/,1:&DATE,
                 28:'R15 DETAIL REPORT',
                 63:'PAGE:',
                 68:&PAGE,/,/,
                 1:'SELL UNIT',
                 13:'NAI ACCOUNT',
                 34:'SLSQ NUM',
                 48:'SYST CREATED',
                 65:'OPEN SELL',
                 75:' ',/),
         SECTIONS=(8,7,15,15,SKIP=0L,
       TRAILER3=(/,
                  1:'====================',
                 21:'====================',
                 41:'====================',
                 61:'===============',/,
                  4:'ACCT TOTAL:',
                 17:'................................',
                 49:'...........',
                 62:TOT=(64,5,PD,EDIT=(I,III,IIT.TTS),
                       SIGNS=(,,,-)),
                 77:' ',/,
                  1:'====================',
                 21:'====================',
                 41:'====================',
                 61:'===============',/))
//
//*-------------------------------------------------------------------*
//*- SPLIT A VB FILE INTO MULTIPLE FB FILES
//*-------------------------------------------------------------------*
//STEP001  EXEC PGM=SORT
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SORTWK01 DD SPACE=(CYL,(100)),UNIT=DISK
//SORTWK02 DD SPACE=(CYL,(300)),UNIT=DISK
//SORTWK03 DD SPACE=(CYL,(300)),UNIT=DISK
//SORTWK04 DD SPACE=(CYL,(300)),UNIT=DISK
//SYSIN    DD *
SORT FIELDS=(6,65,CH,A)
OUTFIL FILES=FILE1,CONVERT,OUTREC=(5,122),
        INCLUDE=(5,1,CH,EQ,C'A')
OUTFIL FILES=FILE2,CONVERT,OUTREC=(5,150),
       INCLUDE=(5,1,CH,EQ,C'B')
/*
//SORTIN   DD DSN=JONNALR.INPUT,DISP=SHR
//FILE1    DD SYSOUT=*
//FILE2    DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//STATOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//*-------------------------------------------------------------------*
//*- CREATE A SIMPLE REPORT
//*- MDY-
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SORTIN    DD *
A4  1000 BOY      11 11  10000
C4  1000 APPLE    11 11  10000
FP  1000 DOG      11 11  10000
G1  1000 CAT      11 11  10000
G4 10000 FISH     12 11  10000
H2 10000 HEN      12 11  10000
L9 10000 ELEPHANT 12 11  10000
N4 10000 FUN      12 11  10000
N4 10000 INK      12 11  10000
N4 20000 FUN      12 11  10000
N4 20000 INK      12 11  10000
/*
//SORTOUT   DD SYSOUT=*
//SYSIN     DD *
 SORT FIELDS=(1,2,CH,A)
 OUTFIL OUTREC=(3:1,2,8:4,5,17:10,8,40:C' '),
      HEADER1=(2:&DATE,//,4X,
   8:'REPORT',/,
   8:'------'),
   HEADER2=(7:'PAGE-',12:&PAGE,/,
        3:'CD#',
        8:'NO:',
       17:'ITEM',/,
        3:'---',
        8:'---',
       17:'----'),LINES=20,
  SECTIONS=(4,5,SKIP=1L,
  HEADER3=(3:'SECTION HEADER'),
  TRAILER3=(/,2:'TOTAL',TOT=(4,5,ZD,EDIT=($II,TTT)))),
  TRAILER2=(1:'GRD-TOT',TOT=(4,5,ZD,EDIT=($II,TTT))),
  TRAILER1=(/,1:'TOTAL RECS',COUNT,/,3:'***** END OF REPORT ***')
/*
//
//*-------------------------------------------------------------------*
//*- CREATE A SIMPLE REPORT
//*- MDY-
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=ICEMAN,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SORTIN    DD *
            DATASET1                                    VOLSE1TYPE001DATE001
            DATASET2                                    VOLSE2TYPE002DATE002
            DATASET3                                    VOLSE3TYPE003DATE003
            DATASET5                                    VOLSE5TYPE005DATE005
/*
//REPORT    DD SYSOUT=*
//SYSIN     DD *
 OPTION COPY
 OUTFIL FNAMES=REPORT,
 HEADER2=('VOLUME/DATASET REPORT',
 30:DATE=(4MD/),45:'PAGE ',PAGE=(M11,LENGTH=3),/,X,/,
 'VOLUME',10:'TYPE',20:'CREATION DATE',36:'DATA SET',/,
 6C'-',10:7C'-',20:13C'-',36:44C'-'),
 OUTREC=(57,6,10:63,7,20:70,7,36:13,44)
/*
//
//*-------------------------------------------------------------------*
//*- ADD VALUE TO A FIELD
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=ICEMAN,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SORTIN    DD *
         001000
         002000
         003000
         004000
         005000
/*
//SORTOUT   DD SYSOUT=*
//SYSIN     DD *
 OPTION COPY
 INREC OVERLAY=(10:10,6,ZD,ADD,+500,TO=ZD,LENGTH=6)
/*
//
//*-------------------------------------------------------------------*
//*- SORT DATA BETWEEN HEADERS AND TRAILERS
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=ICEMAN,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SORTIN    DD *
HEDRINF1 1D342  5 413      1
         34 1 19161  22  5 3 11989 717FANDERSON
         34 213284   22  5 31 1985 7 5FLYONS
         34 C18176   22  5 3 119   1 1FMITCHELL
         34 D196589  52  5 3 12  312 3MBENTON
         34 B252918  62  5 3 11994 122MGONZALEZ
         34 4266757 1 2  5 3 119   1 1MMATHEW
         34 B2868 7  52  5 33 19951  5MSOLORIO
         34 C354835  72  5 3 11966 93 FMACARIO
         34 F4 7832  32  5 3222  5 318FWILSON
TRALINF1 1D342  5 413      1   294138
/*
//SORTOUT   DD SYSOUT=*
//SYSIN     DD *
 INREC IFTHEN=(WHEN=INIT,OVERLAY=(81:C'1')),
       IFTHEN=(WHEN=(1,4,CH,EQ,C'HEDR'),OVERLAY=(81:C'0')),
       IFTHEN=(WHEN=(1,4,CH,EQ,C'TRAL'),OVERLAY=(81:C'9'))
 SORT FIELDS=(81,1,CH,A,14,10,CH,A)
 OUTREC FIELDS=(1,80)
/*
//
//*-------------------------------------------------------------------*
//*- DUPLICATE RECORDS
//*- FIRST DUPLICATE  & NON-DUPLICATES - OUT
//*- REM.  DUPLICATES                  - DUPL
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=ICETOOL,
//             REGION=1024K
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//TOOLMSG   DD SYSOUT=*
//DFSMSG    DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//IN        DD *
AAAAAAAAAA 1
BBBBBBBBBB 1
AAAAAAAAAA 2
BBBBBBBBBB 2
CCCCCCCCCC 1
/*
//OUT       DD SYSOUT=*
//DUPL      DD SYSOUT=*
//TOOLIN    DD *
 SELECT FROM(IN) TO(OUT) ON(1,10,CH) FIRST DISCARD(DUPL)
/*
//
//*-------------------------------------------------------------------*
//*- CHECK FOR NUMERIC VALUE IN A FIELD
//*- INCLUDE COND=(1,6,ZD,EQ,NUM)
//*- INCLUDE COND=(1,6,PD,EQ,NUM)
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SYSOUT    DD SYSOUT=*
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SORTIN    DD DSN=JONNALR.INPUT,
//             DISP=SHR
//SORTOUT   DD DSN=JONNALR.OUTPUT,
//             DISP=SHR
//SYSIN     DD *
 SORT FIELDS=COPY
 INCLUDE COND=(1,4,FS,EQ,NUM)
/*
//
//*-------------------------------------------------------------------*
//*- COMPARE DATES  CCYY-MM-DD
//*- CCYY-MM-DD -- USE DATE1(-)
//*- YYMMDD -- USE Y'DATE1'
//*- YYYYDDD-- USE DATE3P
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SYSOUT    DD SYSOUT=*
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SORTIN    DD DSN=JONNALR.INPUT,
//             DISP=SHR
//SORTOUT   DD DSN=JONNALR.OUTPUT,
//             DISP=SHR
//SYSIN     DD *
 SORT FIELDS=COPY
 INCLUDE COND=(1,10,CH,LT,DATE1(-)-1)

/*
//
//*-------------------------------------------------------------------*
//*- CHANGE DATA  NOMATCH=(C'TEMP'),
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SYSOUT    DD SYSOUT=*
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SORTIN    DD DSN=JONNALR.INPUT,
//             DISP=SHR
//SORTOUT   DD DSN=JONNALR.OUTPUT,
//             DISP=SHR
//SYSIN     DD *
 SORT FIELDS=COPY
 OUTREC FIELDS=(1,4,CHANGE=(4,C'RAMA',C'KRIS',
                              C'SIVA',C'HARI'),
                    NOMATCH=(1,4))

/*
//
//*-------------------------------------------------------------------*
//*- SPLIT A FILE
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=ICEMAN,
//             REGION=1024K
//SYSOUT    DD SYSOUT=*
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SYSOUT    DD SYSOUT=*
//SORTIN    DD DSN=JONNALR.INPUT,DISP=SHR
//OUT1      DD SYSOUT=*
//OUT2      DD SYSOUT=*
//OUT3      DD SYSOUT=*
//SYSIN     DD *
 OPTION COPY
 OUTFIL INCLUDE=(1,4,CH,EQ,C'RAMA'),FNAMES=OUT1
 OUTFIL INCLUDE=(1,4,CH,EQ,C'SIVA'),FNAMES=OUT2
 OUTFIL SAVE,FNAMES=OUT3
/*
//
//*-------------------------------------------------------------------*
//*- COPY A FILE WITH INCLUDE                                         *
//*-------------------------------------------------------------------*
//STEP010 EXEC PGM=SORT,
//             REGION=1024K
//SYSOUT    DD SYSOUT=*
//SORTLIB   DD DISP=SHR,DSN=SYS1.SORTLIB
//SORTIN    DD DSN=JONNALR.INPUT,
//             DISP=SHR
//SORTOUT   DD DSN=JONNALR.OUTPUT,
//             DISP=SHR
//SYSIN     DD *
 SORT FIELDS=COPY
 INCLUDE COND=(1,4,CH,EQ,C'RAMA',OR,1,4,CH,EQ,C'SIVA')
 OUTREC FIELDS=(1:1,4,
 5:6X,
 11:6,2,
 13:2X'00',
 15:C'TEST',
 20:DATE1(-))
/*
//
//SYSIN   DD  *
   SORT FIELDS=COPY
   OUTFIL OUTREC=(1:5,NNNNN),CONVERT,FILES=(OUT),INCLUDE=(ALL)
THE (1,5,800) IS BYTE 1 IN OUTPUT FROM BYTE 5 IN INPUT (SKIPPING BDW)
AND
NNNNN IS LENGTH OF DESIRED OUTPUT
//STEP0100  EXEC PGM=SORT
//SYSOUT    DD SYSOUT=*
//SORTIN    DD DSN=JONNALR.INPUT,
//             DISP=SHR
//FIRST     DD SYSOUT=*
//LAST      DD SYSOUT=*
//WHOLE     DD DSN=JONNALR.WHOLE.FILE,DISP=SHR
//SYSIN     DD *
  SORT FIELDS=COPY
  OUTFIL FNAMES=WHOLE
  OUTFIL FNAMES=FIRST,ENDREC=1
  OUTFIL FNAMES=LAST,NODETAIL,REMOVECC,
  TRAILER1=(1,80)
/*
//
./       ADD   NAME=TMONCIC1
//JONNALRC JOB (0001,TSG),'TMON CICS REPORT....',
//         CLASS=E,
//         MSGCLASS=X,
//         NOTIFY=JONNALR
//*JOBPARM  S=TOYA
//******************************************************************
//*                                                                *
//*        CICS TRANSACTION LOG REPORT                             *
//*                                                                *
//******************************************************************
//STEP1    EXEC PGM=LMRK700,REGION=8M,PARM=TMCE031
//STEPLIB  DD DSN=SYS3.LMK32.TCELOAD,DISP=SHR
//         DD DSN=SYS3.LMK32.LMKLOAD,DISP=SHR
//CTLTMCE  DD DSN=SYST.LMTMCET.TOYA.VTCECNTL,DISP=SHR
//CTLTMON  DD DSN=SYST.LMTMCET.TOYA.VTCECNTL,DISP=SHR
//******************************************************************
//* DAILY LOG CREATED DAILY, 7 DAYS A WEEK                         *
//******************************************************************
//DUMPIN   DD DSN=SYST.CICPDUMP.DAILY(-0),DISP=SHR
//TEMPFIL  DD DSN=&&TEMP,DISP=(NEW,DELETE),
//            DCB=(DSORG=PS,RECFM=VBS,LRECL=32596,BLKSIZE=32600),
//            UNIT=SYSDA,SPACE=(CYL,(500,50))
//SORTWK01 DD SPACE=(CYL,(50,10)),UNIT=SYSDA
//SORTWK02 DD SPACE=(CYL,(50,10)),UNIT=SYSDA
//SORTWK03 DD SPACE=(CYL,(50,10)),UNIT=SYSDA
//REPORTS  DD SYSOUT=*
//PRTCTL   DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//LMRKSNAP DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSIN    DD *
SELECT
  TRANGE 000001 235959
  PROC
    WHEN TASYSID EQ 'CICC' AND TAPTRAN NE 'C' THEN ACCEPT
  REPORT
    LINE  LMRKDATE TAPTRAN TATRANCT TARSPTM TACPURTM TATSKWTM
    SUMF  LMRKDATE TAPTRAN
    SFORM TARSPTM TACPURTM TATSKWTM
    TITLE 'TRANSACTION RESPONSE TIME'
    WIDTH 80
    COVER NO
/*
./       ADD   NAME=ULBMTR
//JONNALRU JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
//****************************************************************
//*   THIS JOB USES THE DB2 UTILITY WITH SQL TO EXTRACT SELECTED *
//*   TABLES FROM PRODUCTION                                     *
//****************************************************************
//ERASE EXEC PGM=IEFBR14,DYNAMNBR=80,REGION=2048K
//DD01    DD DSN=JONNALR.UNLOAD.SYSREC,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD02    DD DSN=JONNALR.UNLOAD.SYSPUNCH,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//*
//********************************************************************
//*            JOB NUMBER : DSNTIAUL WITH PARM('SQL')
//*            FUNCTIONS  : EXTRACT SPECIFIED RECORDS
//********************************************************************
//UNLOAD1  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DSN=PROD.DB2.COMMANDS(#RUNDSNP),DISP=SHR
//         DD DSN=PROD.DB2.COMMANDS(#INDSNP),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSREC00 DD DSN=JONNALR.UNLOAD.SYSREC,
//            DISP=(,CATLG,DELETE),UNIT=SYSDA,SPACE=(CYL,(200,50))
//SYSPUNCH DD DSN=JONNALR.UNLOAD.SYSPUNCH,
//            DISP=(,CATLG,DELETE),UNIT=TEST,SPACE=(TRK,(1,1))
//SYSIN    DD *
   SELECT *
    FROM DVHDIST.TH1_HOLDBACK
   ;
./       ADD   NAME=ULCSV
//UNLDTUDW  EXEC DSNUPROC,SYSTEM=DSNP,UID=UNLDTUDW,
//          SIZE=4096K
//DSNUPROC.SYSIN DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBLO)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBLR)
 UNLOAD DATA FROM TABLE DSVTECH.BLR_ROLE_CURRICLM
      (
       BLR_ROLE_ID         VARCHAR STRIP,
       BLR_FRNHS_CD        VARCHAR STRIP,
       BLR_CURRICLM_ID     VARCHAR STRIP,
       BLR_LANGUAGE        VARCHAR STRIP
      )

  UNLDDN OUTBLR
  DELIMITED

//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBLS)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBLT)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBLV)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBLW)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBNP)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBNQ)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBNS)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBNU)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBNV)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBNW)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBNX)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBNY)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBNZ)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBOA)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDBOB)
//          DD DISP=SHR,DSN=PROD.DB2.COMMANDS(UNLDADZ)
//OUTBLO    DD DSN=SVTT.BLO.CSV(0),
//             DATACLAS=DATAV,SPACE=(CYL,(1,1),RLSE),
//             LRECL=500,RECFM=VB,BLKSIZE=0,DISP=(,CATLG,DELETE)
//OUTBLR    DD DSN=SVTT.BLR.CSV(+1),
//             DATACLAS=DATAV,SPACE=(CYL,(1,1),RLSE),
//             LRECL=500,RECFM=VB,BLKSIZE=0,DISP=(,CATLG,DELETE)
./       ADD   NAME=ULPRDTS
//JONNALRU JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
//****************************************************************
//*   THIS JOB USES THE DB2 UTILITY WITH SQL TO EXTRACT SELECTED *
//*   TABLES FROM PRODUCTION                                     *
//*   FOR UNLOADING SEE PROD.DB2.JCL.NEW(DBVH2ABG)               *
//****************************************************************
//*===========================================================*
//*   EXECUTED BY DBA                                         *
//*===========================================================*
//STEP005  EXEC PGM=IEFBR14
//SYSPRINT DD DUMMY
//DELDD1   DD DSN=JONNALR.UNLD.SYSPUNCH.ABG,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(1,1)),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)
//DELDD2   DD DSN=JONNALR.UNLD.SYSREC.ABG,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(1,1)),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)
//*===========================================================*
//STEP030 EXEC DSNUPROC,SYSTEM=DSNA,UID=DBULABG,UTPROC=''
//*DSNUPROC.SYSREC  DD DUMMY,DISP=SHR
//DSNUPROC.SYSREC   DD DSN=JONNALR.UNLD.SYSREC.ABG,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(CYL,(10,2),RLSE)
//*DSNUPROC.SYSPUNCH DD DUMMY
//DSNUPROC.SYSPUNCH DD DSN=JONNALR.UNLOAD.SYSREC,
//            DISP=(,CATLG,DELETE),UNIT=TEST,SPACE=(TRK,(1,1))
//DSNUPROC.SYSIN    DD *
 UNLOAD TABLESPACE DTCCORP.SVHMDABG
 FROMCOPY VHDB.FULLCOPY.DTCCORP.SVHMDABG.G1269V00
//
./       ADD   NAME=ULPROD
//JONNALRU JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
//****************************************************************
//*   THIS JOB USES THE DB2 UTILITY WITH SQL TO EXTRACT SELECTED *
//*   TABLES FROM PRODUCTION                                     *
//****************************************************************
//ERASE EXEC PGM=IEFBR14,DYNAMNBR=80,REGION=2048K
//DD07    DD DSN=JONNALR.UNLOAD.SYSREC.TF1.JAN27,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD07B   DD DSN=JONNALR.UNLOAD.SYSPUNCH.TF1.JAN27,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//*
//********************************************************************
//*            JOB NUMBER : DSNTIAUL WITH PARM('SQL')
//*            FUNCTIONS  : EXTRACT SPECIFIED RECORDS
//********************************************************************
//UNLOAD1  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DSN=PROD.DB2.COMMANDS(#RUNDSNP),DISP=SHR
//         DD DSN=PROD.DB2.COMMANDS(#INDSNP),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSREC00 DD DSN=JONNALR.UNLOAD.SYSREC.TF1.JAN27,
//            DISP=(,CATLG,DELETE),UNIT=SYSDA,SPACE=(CYL,(200,50))
//SYSPUNCH DD DSN=JONNALR.UNLOAD.SYSPUNCH.TF1.JAN27,
//            DISP=(,CATLG,DELETE),UNIT=TEST,SPACE=(TRK,(1,1))
//SYSIN    DD *
   SELECT * FROM
    DVHDIST.TF1_SALES_IN_OUT
   ;
./       ADD   NAME=ULTEST
//JONNALRU JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
//****************************************************************
//*   THIS JOB USES THE DB2 UTILITY WITH SQL TO EXTRACT SELECTED *
//*   TABLES FROM PRODUCTION                                     *
//****************************************************************
//ERASE EXEC PGM=IEFBR14,DYNAMNBR=80,REGION=2048K
//DD01    DD DSN=JONNALR.UNLOAD.SYSREC.TB3,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//DD01B   DD DSN=JONNALR.UNLOAD.SYSPUNCH.TB3,
//           UNIT=TEST,SPACE=(TRK,0),DISP=(MOD,DELETE)
//*
//********************************************************************
//*            JOB NUMBER : DSNTIAUL WITH PARM('SQL')
//*            FUNCTIONS  : EXTRACT SPECIFIED RECORDS
//********************************************************************
//UNLOAD1  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DSN=PROD.DB2.COMMANDS(#RUNDSNT),DISP=SHR
//         DD DSN=PROD.DB2.COMMANDS(#INDSNT),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSREC00 DD DSN=JONNALR.UNLOAD.SYSREC.TB3,
//            DISP=(,CATLG,DELETE),UNIT=SYSALLDA,SPACE=(CYL,(20,10))
//SYSPUNCH DD DSN=JONNALR.UNLOAD.SYSPUNCH.TB3,
//            DISP=(,CATLG,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(1,1))
//SYSIN    DD *
   SELECT * FROM  DBMDFIN.TB3_STMT_LEXUS ;
/*
//*
//
./       ADD   NAME=VBLEN
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=A,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR,TYPRUN=SCAN
/*JOBPARM SYSAFF=TOYB
//S1 EXEC SORT,REGION=6M
//SORTIN  DD DISP=SHR,DSN=CARS.PUBREAD.DAILY.SMF
//SORTOUT  DD DISP=(,PASS),UNIT=WORK,DSN=&&LENGTH,SPACE=(CYL,(1,1))
//SYSIN DD *
 SORT FIELDS=(1,2,FI,A)
 SUM FIELDS=NONE
 OUTREC FIELDS=(1,4,1,2)
//S2 EXEC PGM=IDCAMS
//IN1 DD DISP=(OLD,DELETE),DSN=&&LENGTH
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
 PRINT INFILE(IN1)
//
./       ADD   NAME=VHAC010
VHAC010  DFHMSD TYPE=DSECT,                                            C
               MODE=INOUT,                                             C
               LANG=COBOL,                                             C
               TIOAPFX=YES
********************************************************************
**                    HEADER  LINES                               **
********************************************************************
VHAC010  DFHMDI COLUMN=NEXT,LINE=NEXT,                                 C
               CTRL=(FREEKB),                                          C
               SIZE=(024,080)
         DFHMDF LENGTH=008,POS=(001,001),                              C
               INITIAL='VHAC010P',                                     C
               ATTRB=(ASKIP,NORM)
HEADING DFHMDF LENGTH=039,POS=(001,024),                               C
               INITIAL='***  MODEL PRICE MAINTENANCE  ***',            C
               ATTRB=(ASKIP,BRT)
         DFHMDF LENGTH=008,POS=(001,072),                              C
               INITIAL='VHAC010U',                                     C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=011,POS=(003,001),                              C
               INITIAL='MODEL CODE:',                                  C
               ATTRB=(ASKIP,BRT)
MODCOD DFHMDF LENGTH=005,POS=(003,013),                                C
               INITIAL='XXXXX',                                        C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=006,POS=(003,021),                              C
               INITIAL='TRANS:',                                       C
               ATTRB=(ASKIP,BRT)
TRANS DFHMDF LENGTH=001,POS=(003,028),                                 C
               INITIAL='X',                                            C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=012,POS=(003,032),                              C
               INITIAL='SERIES CODE:',                                 C
               ATTRB=(ASKIP,BRT)
SERIES DFHMDF LENGTH=003,POS=(003,045),                                C
               INITIAL='XXX',                                          C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=013,POS=(003,060),                              C
               INITIAL='VEHICLE TYPE:',                                C
               ATTRB=(ASKIP,BRT)
VEHTYP DFHMDF LENGTH=001,POS=(003,074),                                C
               INITIAL='X',                                            C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=011,POS=(004,001),                              C
               INITIAL='MODEL YEAR:',                                  C
               ATTRB=(ASKIP,BRT)
MODYR DFHMDF LENGTH=002,POS=(004,013),                                 C
               INITIAL='YY',                                           C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=013,POS=(004,031),                              C
               INITIAL='SOURCE PLANT:',                                C
               ATTRB=(ASKIP,BRT)
SRCPLT DFHMDF LENGTH=006,POS=(004,045),                                C
               INITIAL='XXXXXX',                                       C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=011,POS=(004,062),                              C
               INITIAL='PLANT CODE:',                                  C
               ATTRB=(ASKIP,BRT)
PRDSRC DFHMDF LENGTH=001,POS=(004,074),                                C
               INITIAL='X',                                            C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=013,POS=(005,001),                              C
               INITIAL='MODEL NUMBER:',                                C
               ATTRB=(ASKIP,BRT)
MODNUM DFHMDF LENGTH=005,POS=(005,016),                                C
               INITIAL='XXXXX',                                        C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=010,POS=(005,034),                              C
               INITIAL='KATASHIKI:',                                   C
               ATTRB=(ASKIP,BRT)
JAPCOD DFHMDF LENGTH=015,POS=(005,045),                                C
               INITIAL='XXXXXXXXXXXXXXX',                              C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=016,POS=(006,008),                              C
               INITIAL='SHIPPING WEIGHT:',                             C
               ATTRB=(ASKIP,BRT)
SHIPWGT DFHMDF LENGTH=004,POS=(006,033),                               C
               PICOUT='ZZZ9',                                          C
               INITIAL='0000',                                         C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=023,POS=(006,043),                              C
               INITIAL='SUGGESTED RETAIL PRICE:',                      C
               ATTRB=(ASKIP,BRT)
         DFHMDF LENGTH=001,POS=(006,067),                              C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
RETAIL DFHMDF LENGTH=010,POS=(006,069),                                C
               PICOUT='ZZZ,ZZ9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=016,POS=(007,008),                              C
               INITIAL='ORIGIN HANDLING:',                             C
               ATTRB=(ASKIP,BRT)
         DFHMDF LENGTH=001,POS=(007,026),                              C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
HANDLG DFHMDF LENGTH=009,POS=(007,028),                                C
               PICOUT='ZZ,ZZ9.99',                                     C
               INITIAL='000000000',                                    C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=015,POS=(007,051),                              C
               INITIAL='TMC DEALER NET:',                              C
               ATTRB=(ASKIP,BRT)
         DFHMDF LENGTH=001,POS=(007,067),                              C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
DLRNET DFHMDF LENGTH=009,POS=(007,070),                                C
               PICOUT='ZZ,ZZ9.99',                                     C
               INITIAL='     0.00 ',                                   C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=021,POS=(008,003),                              C
               INITIAL='TCI ADDED DEALER NET:',                        C
               ATTRB=(ASKIP,BRT)
         DFHMDF LENGTH=001,POS=(008,026),                              C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
ADDNET DFHMDF LENGTH=009,POS=(008,028),                                C
               PICOUT='ZZ,ZZ9.99',                                     C
               INITIAL='000000000',                                    C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=011,POS=(008,055),                              C
               INITIAL='EXCISE TAX:',                                  C
               ATTRB=(ASKIP,BRT)
         DFHMDF LENGTH=001,POS=(008,067),                              C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
EXCTAX DFHMDF LENGTH=009,POS=(008,070),                                C
               PICOUT='ZZ,ZZ9.99',                                     C
               INITIAL='     0.00 ',                                   C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=007,POS=(009,029),                              C
               INITIAL='CURRENT',                                      C
               ATTRB=(ASKIP,BRT)
         DFHMDF LENGTH=009,POS=(009,040),                              C
               INITIAL='EFFECTIVE',                                    C
               ATTRB=(ASKIP,BRT)
         DFHMDF LENGTH=003,POS=(009,056),                              C
               INITIAL='NEW',                                          C
               ATTRB=(ASKIP,BRT)
         DFHMDF LENGTH=009,POS=(009,068),                              C
               INITIAL='EFFECTIVE',                                    C
               ATTRB=(ASKIP,BRT)
         DFHMDF LENGTH=005,POS=(010,030),                              C
               INITIAL='PRICE',                                        C
               ATTRB=(ASKIP,BRT)
         DFHMDF LENGTH=004,POS=(010,042),                              C
               INITIAL='DATE',                                         C
               ATTRB=(ASKIP,BRT)
         DFHMDF LENGTH=005,POS=(010,055),                              C
               INITIAL='PRICE',                                        C
               ATTRB=(ASKIP,BRT)
         DFHMDF LENGTH=004,POS=(010,070),                              C
               INITIAL='DATE',                                         C
               ATTRB=(ASKIP,BRT)
********************************************************************
**                       TCI MARGIN                               **
********************************************************************
LINE11 DFHMDF LENGTH=023,POS=(011,001),                                C
               INITIAL='            TCI MARGIN:',                      C
               ATTRB=(ASKIP,NORM)
MRGSGNC DFHMDF LENGTH=001,POS=(011,025),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
CURMARG DFHMDF LENGTH=010,POS=(011,027),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
        DFHMDF LENGTH=001,POS=(011,038),ATTRB=ASKIP
MARGDTC DFHMDF LENGTH=010,POS=(011,040),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
        DFHMDF LENGTH=001,POS=(011,051),ATTRB=ASKIP
MRGSGNN DFHMDF LENGTH=001,POS=(011,053),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
NEWMARG DFHMDF LENGTH=010,POS=(011,055),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(011,066),ATTRB=ASKIP
MARGDTN DFHMDF LENGTH=010,POS=(011,068),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(011,079),ATTRB=ASKIP
********************************************************************
**                       ADVERTISING FUND                         **
********************************************************************
LINE12 DFHMDF LENGTH=023,POS=(012,001),                                C
               INITIAL='      ADVERTISING FUND:',                      C
               ATTRB=(ASKIP,BRT)
FNDSGNC DFHMDF LENGTH=001,POS=(012,025),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
CURFUND DFHMDF LENGTH=010,POS=(012,027),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
        DFHMDF LENGTH=001,POS=(012,038),ATTRB=ASKIP
FUNDDTC DFHMDF LENGTH=010,POS=(012,040),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
        DFHMDF LENGTH=001,POS=(011,051),ATTRB=ASKIP
FNDSGNN DFHMDF LENGTH=001,POS=(012,053),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
NEWFUND DFHMDF LENGTH=010,POS=(012,055),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(012,066),ATTRB=ASKIP
FUNDDTN DFHMDF LENGTH=010,POS=(012,068),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(012,079),ATTRB=ASKIP
********************************************************************
**                       PLI                                      **
********************************************************************
LINE13 DFHMDF LENGTH=023,POS=(013,001),                                C
               INITIAL='                   PLI:',                      C
               ATTRB=(ASKIP,BRT)
PLISGNC DFHMDF LENGTH=001,POS=(013,025),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
CURPLI  DFHMDF LENGTH=010,POS=(013,027),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(013,038),ATTRB=ASKIP
PLIDTC  DFHMDF LENGTH=010,POS=(013,040),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
        DFHMDF LENGTH=001,POS=(011,051),ATTRB=ASKIP
PLISGNN DFHMDF LENGTH=001,POS=(013,053),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
NEWPLI  DFHMDF LENGTH=010,POS=(013,055),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(013,066),ATTRB=ASKIP
PLIDTN  DFHMDF LENGTH=010,POS=(013,068),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(013,079),ATTRB=ASKIP
********************************************************************
**                       SELLING EXPENSE                          **
********************************************************************
LINE14 DFHMDF LENGTH=023,POS=(014,001),                                C
               INITIAL='       SELLING EXPENSE:',                      C
               ATTRB=(ASKIP,BRT)
EXPSGNC DFHMDF LENGTH=001,POS=(014,025),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
CUREXP  DFHMDF LENGTH=010,POS=(014,027),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(014,038),ATTRB=ASKIP
EXPDTC  DFHMDF LENGTH=010,POS=(014,040),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
        DFHMDF LENGTH=001,POS=(011,051),ATTRB=ASKIP
EXPSGNN DFHMDF LENGTH=001,POS=(014,053),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
NEWEXP  DFHMDF LENGTH=010,POS=(014,055),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(014,066),ATTRB=ASKIP
EXPDTN  DFHMDF LENGTH=010,POS=(014,068),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(014,079),ATTRB=ASKIP
********************************************************************
**              AVERAGE INLAND FREIGHT                            **
********************************************************************
LINE15 DFHMDF LENGTH=023,POS=(015,001),                                C
               INITIAL='AVERAGE INLAND FREIGHT:',                      C
               ATTRB=(ASKIP,BRT)
INFSGNC DFHMDF LENGTH=001,POS=(015,025),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
CURINFR DFHMDF LENGTH=010,POS=(015,027),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(015,038),ATTRB=ASKIP
INFDTC  DFHMDF LENGTH=010,POS=(015,040),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
        DFHMDF LENGTH=001,POS=(011,051),ATTRB=ASKIP
INFSGNN DFHMDF LENGTH=001,POS=(015,053),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
NEWINFR DFHMDF LENGTH=010,POS=(015,055),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(015,066),ATTRB=ASKIP
INFDTN  DFHMDF LENGTH=010,POS=(015,068),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(015,079),ATTRB=ASKIP
********************************************************************
**                    IMPORT DUTY                                 **
********************************************************************
LINE16 DFHMDF LENGTH=023,POS=(016,001),                                C
               INITIAL='           IMPORT DUTY:',                      C
               ATTRB=(ASKIP,BRT)
DUTSGNC DFHMDF LENGTH=001,POS=(016,025),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
CURDUTY DFHMDF LENGTH=010,POS=(016,027),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(016,038),ATTRB=ASKIP
DUTDTC  DFHMDF LENGTH=010,POS=(016,040),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
        DFHMDF LENGTH=001,POS=(011,051),ATTRB=ASKIP
DUTSGNN DFHMDF LENGTH=001,POS=(016,053),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
NEWDUTY DFHMDF LENGTH=010,POS=(016,055),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(016,066),ATTRB=ASKIP
DUTDTN  DFHMDF LENGTH=010,POS=(016,068),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(016,079),ATTRB=ASKIP
********************************************************************
**                    INTEREST CHARGES                            **
********************************************************************
LINE17 DFHMDF LENGTH=023,POS=(017,001),                                C
               INITIAL='      INTEREST CHARGES:',                      C
               ATTRB=(ASKIP,BRT)
INTSGNC DFHMDF LENGTH=001,POS=(017,025),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
CURINT  DFHMDF LENGTH=010,POS=(017,027),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(017,038),ATTRB=ASKIP
INTDTC  DFHMDF LENGTH=010,POS=(017,040),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
        DFHMDF LENGTH=001,POS=(011,051),ATTRB=ASKIP
INTSGNN DFHMDF LENGTH=001,POS=(017,053),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
NEWINT  DFHMDF LENGTH=010,POS=(017,055),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(017,066),ATTRB=ASKIP
INTDTN  DFHMDF LENGTH=010,POS=(017,068),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(017,079),ATTRB=ASKIP
********************************************************************
**                    MARINE INSURANCE                            **
********************************************************************
LINE18 DFHMDF LENGTH=023,POS=(018,001),                                C
               INITIAL='      MARINE INSURANCE:',                      C
               ATTRB=(ASKIP,BRT)
INSSGNC DFHMDF LENGTH=001,POS=(018,025),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
CURINS  DFHMDF LENGTH=010,POS=(018,027),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(018,038),ATTRB=ASKIP
INSDTC  DFHMDF LENGTH=010,POS=(018,040),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
        DFHMDF LENGTH=001,POS=(011,051),ATTRB=ASKIP
INSSGNN DFHMDF LENGTH=001,POS=(018,053),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
NEWINS  DFHMDF LENGTH=010,POS=(018,055),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(018,066),ATTRB=ASKIP
INSDTN  DFHMDF LENGTH=010,POS=(018,068),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(018,079),ATTRB=ASKIP
********************************************************************
**                    OCEAN FREIGHT                               **
********************************************************************
LINE19 DFHMDF LENGTH=023,POS=(019,001),                                C
               INITIAL='         OCEAN FREIGHT:',                      C
               ATTRB=(ASKIP,BRT)
OCFSGNC DFHMDF LENGTH=001,POS=(019,025),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
CUROCFR DFHMDF LENGTH=010,POS=(019,027),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(019,038),ATTRB=ASKIP
OCFDTC  DFHMDF LENGTH=010,POS=(019,040),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
        DFHMDF LENGTH=001,POS=(011,051),ATTRB=ASKIP
OCFSGNN DFHMDF LENGTH=001,POS=(019,053),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
NEWOCFR DFHMDF LENGTH=010,POS=(019,055),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(019,066),ATTRB=ASKIP
OCFDTN  DFHMDF LENGTH=010,POS=(019,068),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(019,079),ATTRB=ASKIP
********************************************************************
**                    FOB PRICE                                   **
********************************************************************
LINE20 DFHMDF LENGTH=023,POS=(020,001),                                C
               INITIAL='     FOB PRICE (CDN $):',                      C
               ATTRB=(ASKIP,BRT)
FOBSGNC DFHMDF LENGTH=001,POS=(020,025),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
CURFOB  DFHMDF LENGTH=010,POS=(020,027),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(020,038),ATTRB=ASKIP
FOBDTC  DFHMDF LENGTH=010,POS=(020,040),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
        DFHMDF LENGTH=001,POS=(011,051),ATTRB=ASKIP
FOBSGNN DFHMDF LENGTH=001,POS=(020,053),                               C
               INITIAL='$',                                            C
               ATTRB=(ASKIP,NORM)
NEWFOB  DFHMDF LENGTH=010,POS=(020,055),                               C
               PICOUT='---,--9.99',                                    C
               INITIAL='0000000000',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(020,066),ATTRB=ASKIP
FOBDTN  DFHMDF LENGTH=010,POS=(020,068),                               C
               INITIAL='CCYY-MM-DD',                                   C
               ATTRB=(UNPROT,NORM)
               DFHMDF LENGTH=001,POS=(020,079),ATTRB=ASKIP
********************************************************************
**                    ERROR MESSAGE LINE                          **
********************************************************************
ERRMSG DFHMDF LENGTH=079,POS=(021,001),                                C
               ATTRB=(ASKIP,BRT)
********************************************************************
**                    PFKEYS LINE                                 **
********************************************************************
         DFHMDF LENGTH=021,POS=(022,001),                              C
               INITIAL='PF01=NEXT MODEL/PLANT',                        C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=025,POS=(022,027),                              C
               INITIAL='PF02=PREVIOUS MODEL/PLANT',                    C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=009,POS=(022,060),                              C
               INITIAL='PF04=QUIT',                                    C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=023,POS=(023,001),                              C
               INITIAL='PF05=MODEL PRICING/COST',                      C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=020,POS=(023,027),                              C
               INITIAL='PF06=HISTORICAL COST',                         C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=011,POS=(023,060),                              C
               INITIAL='PF07=UPDATE',                                  C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=022,POS=(024,001),                              C
               INITIAL='PF09=MODEL LANDED COST',                       C
               ATTRB=(ASKIP,NORM)
         DFHMDF LENGTH=018,POS=(024,027),                              C
               INITIAL='PF10=MODEL INQUIRY',                           C
               ATTRB=(ASKIP,NORM)
         DFHMSD TYPE=FINAL
         END
./       ADD   NAME=VHAC395R
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
/*JOBPARM SYSAFF=TOYB
//JOBLIB    DD DSN=TEST.BATCH.LOAD,DISP=SHR
//          DD DSN=PROD.BATCH.LOAD,DISP=SHR
//*
//*-------------------------------------------------------------------*
//*  CLOSE CICS FILES                                                 *
//*-------------------------------------------------------------------*
//STEP030   EXEC PGM=MTPBATCH
//SYSLST    DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//BATCNTL   DD DSN=SYST.BMTP.TESTCNTL.FILE,DISP=SHR
//BATSTAT   DD DSN=SYST.BMTP.TESTSTAT.FILE,DISP=SHR
//SYSIPT    DD *
CICS CICSTAOR
CEMT S FILE(DEALER) CLO
/*
//*
//*-------------------------------------------------------------------*
//*  MODIFY DEALER           FILES ACCORDING TO THE NEW LAYOUT        *
//*-------------------------------------------------------------------*
//STEP040 EXEC PGM=IKJEFT1A,
//             REGION=1024K,
//             COND=(0,NE)
//*
//SYSOUT    DD SYSOUT=X
//SYSUDUMP  DD SYSOUT=X
//SYSTSPRT  DD SYSOUT=X
//DEALER    DD DSN=TCIP$DV.DEALER.PRIMARY,
//             DISP=SHR
//SYSTSIN  DD DSN=PROD.DB2.COMMANDS(#RUNDSNT),DISP=SHR
//         DD DSN=ACPT.DB2.COMMANDS(VHAC395B),DISP=SHR
//*-------------------------------------------------------------------*
//*  OPEN  CICS FILES                                                 *
//*-------------------------------------------------------------------*
//STEP050   EXEC PGM=MTPBATCH
//SYSLST    DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//BATCNTL   DD DSN=SYST.BMTP.TESTCNTL.FILE,DISP=SHR
//BATSTAT   DD DSN=SYST.BMTP.TESTSTAT.FILE,DISP=SHR
//SYSIPT    DD *
CICS CICSTAOR
CEMT S FILE(DEALER) OPE
/*
//*
//
//*------------------------------------------------------------------*
//*   DELETE TEMPORARY FILES                                         *
//*------------------------------------------------------------------*
//CLEANUP  EXEC  PGM=IEFBR14
//DEL001     DD    DSN=VHDI$DV.MODEL.BKUP.FEB21,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//DEL002     DD    DSN=VHDI$DV.OPTION.BKUP.FEB21,
//           DISP=(MOD,DELETE,DELETE),UNIT=TEST,SPACE=(TRK,0)
//*
//*------------------------------------------------------------------*
//*   BACKUP UP PRODUCTION MODEL  FILE BEFORE CONVERSION             *
//*------------------------------------------------------------------*
//STEP010  EXEC PGM=IDCAMS,REGION=1024K
//SYSPRINT DD  SYSOUT=X
//SEQ      DD  DSN=VHDI$DV.MODEL.MASTER,DISP=SHR
//OUT      DD  DSN=VHDI$DV.MODEL.BKUP.FEB21,
//             UNIT=TEST,SPACE=(TRK,(10,10),RLSE),
//             DCB=(RECFM=FB,LRECL=01017,BLKSIZE=0),
//             DISP=(NEW,CATLG)
//SYSIN    DD  DSN=PROD.BATCH.CNTL(REPRO),DISP=SHR
//*
//*------------------------------------------------------------------*
//*   BACKUP UP PRODUCTION OPTION FILE BEFORE CONVERSION             *
//*------------------------------------------------------------------*
//STEP020  EXEC PGM=IDCAMS,REGION=1024K
//SYSPRINT DD  SYSOUT=X
//SEQ      DD  DSN=VHDI$DV.OPTION.MASTER,DISP=SHR
//OUT      DD  DSN=VHDI$DV.OPTION.BKUP.FEB21,
//             UNIT=TEST,SPACE=(TRK,(10,10),RLSE),
//             DCB=(RECFM=FB,LRECL=00350,BLKSIZE=0),
//             DISP=(NEW,CATLG)
//SYSIN    DD  DSN=PROD.BATCH.CNTL(REPRO),DISP=SHR
//*
//*-------------------------------------------------------------------*
//*  CLOSE CICS FILES                                                 *
//*-------------------------------------------------------------------*
//STEP030   EXEC PGM=MTPBATCH
//SYSLST    DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//BATCNTL   DD DSN=SYST.BMTP.TESTCNTL.FILE,DISP=SHR
//BATSTAT   DD DSN=SYST.BMTP.TESTSTAT.FILE,DISP=SHR
//SYSIPT    DD *
CICS CICSTAOR
CEMT S FILE(MODEL) CLO
CEMT S FILE(OPTION) CLO
CEMT I FILE(MODEL)
CEMT I FILE(OPTION)
/*
//*
//*-------------------------------------------------------------------*
//*  MODIFY MODEL AND OPTION FILES ACCORDING TO THE NEW LAYOUT        *
//*-------------------------------------------------------------------*
//STEP040 EXEC PGM=IKJEFT1A,
//             REGION=1024K,
//             COND=(0,NE)
//*
//SYSOUT    DD SYSOUT=X
//SYSUDUMP  DD SYSOUT=X
//SYSTSPRT  DD SYSOUT=X
//MODEL     DD DSN=VHDI$DV.MODEL.MASTER1,
//             DISP=SHR
//OPTION    DD DSN=VHDI$DV.OPTION.MASTER1,
//             DISP=SHR
//SYSTSIN  DD DSN=PROD.DB2.COMMANDS(#RUNDSNP),DISP=SHR
//         DD DSN=PROD.DB2.COMMANDS(VHAC395B),DISP=SHR
//*-------------------------------------------------------------------*
//*  OPEN  CICS FILES                                                 *
//*-------------------------------------------------------------------*
//STEP050   EXEC PGM=MTPBATCH
//SYSLST    DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//BATCNTL   DD DSN=SYST.BMTP.TESTCNTL.FILE,DISP=SHR
//BATSTAT   DD DSN=SYST.BMTP.TESTSTAT.FILE,DISP=SHR
//SYSIPT    DD *
CICS CICSTAOR
CEMT S FILE(MODEL) OPE
CEMT S FILE(OPTION) OPE
CEMT I FILE(MODEL)
CEMT I FILE(OPTION)
/*
//*
./       ADD   NAME=VHAC3951
//*  C395R JOB (1504,VHAC),'MODEL OPTION CNV ',
//             MSGLEVEL=(1,1),
//             USER=VHUSER,NOTIFY=SHATTLA,
//             MSGCLASS=X,REGION=4096K,
//             CLASS=P
/*JOBPARM PROCLIB=PROD
//JOBLIB    DD DSN=PROD.BATCH.LOAD,DISP=SHR
//*
//*********************************************************************
//*                                                                   *
//*  RESTORE THE MODEL AND OPTION VSAM FILES IF REQUIRED              *
//*                                                                   *
//*********************************************************************
//**************************************************
//STEP010  EXEC PGM=IDCAMS,
//             REGION=1024K,
//             COND=(0,NE)
//SYSPRINT DD  SYSOUT=X
//INFILE1   DD DSN=VHDI.MODEL.MASTER,
//             DISP=SHR
//SYSIN     DD *
   VERIFY FILE (INFILE1)
//*
//*
//STEP020 EXEC PGM=IDCAMS,REGION=1024K,COND=(0,NE)
//SYSPRINT DD  SYSOUT=X
//SEQ      DD  DSN=VHDI.MODEL.MASTER.MSRP.B4,DISP=SHR
//OUT      DD  DSN=VHDI.MODEL.MASTER,
//             DISP=OLD
//SYSIN    DD  *
     REPRO -
          INFILE(SEQ) -
          OUTFILE(OUT) -
          REPLACE
//*
//STEP2   EXEC PGM=IDCAMS,REGION=1024K,COND=(0,NE)
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DSN=PROD.BATCH.VSAM(MODELD),DISP=SHR
//         DD  DSN=PROD.BATCH.VSAM(MODELF),DISP=SHR
./       ADD   NAME=VHDIGDG
//JONNALR1 JOB (TEST,DEV),'RAMA  JON-2166',CLASS=F,MSGCLASS=X,
//             REGION=8M,NOTIFY=JONNALR
//****************************************************************
//*   THIS JOB USES THE IDCAMS UTILITY TO BUILD GDG BASES        *
//*   FOR THE VEHICLE INVOCES MONTHLY FILES                      *
//****************************************************************
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
  DEFINE GDG (NAME('VHSA$DV.ACCUM.RECEIVE.RESULT.DAILY') -
              LIMIT(30) -
              SCRATCH)
/*
//*
//STEP02    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
  DEFINE GDG (NAME('VHSA$DV.ACCUM.RECEIVE.RESULT.MONTHLY') -
              LIMIT(12) -
              SCRATCH)
/*
./       ADD   NAME=V7EXT
//JONNALRV  JOB (TEST,DEV),'EXTRACT V7 TABLE',CLASS=A,
//          NOTIFY=JONNALR,MSGCLASS=X,MSGLEVEL=(1,1)
//*--------------------------------------------------------------------
//STEP020 EXEC PGM=IKJEFT1A,
//             REGION=4096K,
//             COND=(0,NE)
//STEPLIB   DD DSN=TEST.BATCH.LOAD,DISP=SHR
//          DD DSN=PROD.BATCH.LOAD,DISP=SHR
//SYSTSIN   DD *
  DSN SYSTEM(DSNP)
  RUN PROGRAM (V7EXT) PLAN(V7EXT)                                       00010000
/*
//SYSTSPRT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//VINLIST   DD DSN=JONNALR.INPUT,
//             DISP=SHR                                                 S MOTORS
//V7EXTO    DD SYSOUT=*
//PACC998O  DD SYSOUT=*,RECFM=FBA,BLKSIZE=0
//DATEDD    DD DUMMY
//
